[
    {
        "year": "约公元前250万年",
        "title": "旧石器时代开始",
        "description": "人类历史的开端，早期人属动物（如能人、直立人）开始制造和使用简单的石器，标志着工具使用的萌芽。",
        "expandedDescription": "<h3>人类演化的关键阶段</h3><p>旧石器时代是人类发展的第一阶段，从约250万年前持续到约1万年前。这个时期以石器工具的使用为主要特征，人类主要通过狩猎和采集为生。早期人属动物如能人（直立人）在此阶段出现并演化，他们逐渐掌握了火的使用和更复杂的生存技能。这一时期对人类的体质和智力发展奠定了基础。",
        "type": "world"
    },
    {
        "year": "约公元前7万年",
        "title": "认知革命",
        "description": "现代人类（智人）在认知能力上发生重大飞跃，发展出复杂的语言、抽象思维和象征性行为。",
        "expandedDescription": "<h3>思维的飞跃</h3><p>认知革命是指约7万至5万年前，智人在认知能力上发生的显著变化。这一时期，人类的语言能力、抽象思维、想象力和创造力得到了极大的发展，使他们能够进行复杂的交流、规划和协作。</p><h3>文化与象征</h3><p>认知革命的证据包括艺术创作（如洞穴壁画、雕塑）、装饰品（如贝壳项链）、宗教仪式和复杂的工具制造。这些行为表明智人已经具备了象征性思维，能够用符号代表事物，并传递抽象的概念和信仰。</p><h3>对人类历史的影响</h3><p>认知革命使智人拥有了前所未有的文化传播和积累能力。他们能够通过语言将复杂的知识和经验传递给后代，形成文化传统。这种能力是智人最终能够走出非洲、取代其他人类物种并建立复杂文明的关键因素。</p>",
        "type": "world"
    },
    {
        "year": "约公元前5万年",
        "title": "晚期智人走出非洲",
        "description": "具有现代认知能力的智人开始大规模迁徙，最终遍布全球，并取代了其他古人类。",
        "expandedDescription": "<h3>人类第二次大迁徙</h3><p>约7万年前，现代人类（智人）开始从非洲向其他大陆迁徙。这次迁徙被认为是人类历史上最重要的事件之一，它导致了现代人类在全球范围内的分布。与早期人类迁徙不同，智人具有更先进的工具技术、语言能力和社会结构，这使得他们能够更好地适应各种环境。</p><h3>迁徙路线与时间</h3><p>智人走出非洲的路线主要有两条：一条是通过红海进入阿拉伯半岛，然后向东扩散到亚洲和澳大利亚；另一条是通过北非进入欧洲。他们沿着非洲大陆的边缘向北和向东迁移，逐渐进入了亚洲和欧洲。在迁徙过程中，他们面临着各种挑战，如适应新的气候和环境、寻找食物和水源等。</p><h3>技术与适应</h3><p>走出非洲的早期智人携带了阿舍利文化的石器技术，这种技术比早期的奥杜威文化更为先进。他们制造了手斧等工具，用于狩猎和处理食物。在新的环境中，他们不断调整生存策略，逐渐适应了不同的气候和生态系统。</p><h3>重要遗址</h3><p>在亚洲，发现了许多直立人的化石和遗址，如中国的元谋人、北京人，以及印度尼西亚的爪哇人。在欧洲，也发现了一些可能与直立人相关的遗址。这些发现表明，早期智人在走出非洲后，成功地在不同地区定居并繁衍。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1.2万年",
        "title": "全新世开始",
        "description": "地球进入地质学上的全新世，气候变得相对稳定和温暖，为农业的产生提供了有利条件。",
        "expandedDescription": "<h3>地质时代的划分</h3><p>全新世是当前地质时代，始于约1.17万年前，标志着上一个冰河期（更新世）的结束。全新世的开始以气候的显著变暖和稳定为特征。</p><h3>对人类的影响</h3><p>全新世相对温和稳定的气候为人类社会的发展提供了有利的自然环境。野生动植物种类和分布的变化，以及更可预测的季节性气候，为人类从狩猎采集向农业定居的转变创造了条件。这一转变最终导致了新石器革命和早期文明的出现。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1万年",
        "title": "新石器时代开始 (农业革命)",
        "description": "人类开始驯化动植物，发展农业和畜牧业，实现定居生活，是人类社会发展的重要转折点。",
        "expandedDescription": "<h3>定居的开始</h3><p>新石器时代（约公元前10000年-公元前2000年）是人类历史上的一个重要阶段，标志着从狩猎采集的游牧生活向农业定居生活的转变。这一转变通常被称为“新石器革命”或“农业革命”。</p><h3>农业与畜牧业</h3><p>新石器时代的人类开始驯化野生植物（如小麦、大麦、水稻）和动物（如狗、猪、牛、羊），发展出农业和畜牧业。这使得人类能够生产出稳定的食物来源，不再完全依赖自然资源的供给。</p><h3>社会与技术变革</h3><p>农业的发展导致了人口增长、村落和城镇的出现。人们开始制造陶器用于储存食物和水，发展出更精细的石器和骨器。定居生活也促进了社会组织的复杂化和手工业的发展。",
        "type": "world"
    },
    {
        "year": "约公元前7000年",
        "title": "陶器发明",
        "description": "陶器的广泛使用标志着新石器时代的一项重要技术革新，用于储存、烹饪和运输。",
        "expandedDescription": "<h3>陶器的诞生</h3><p>陶器的发明是新石器时代的重要标志之一。早期人类发现粘土经过火烧后会变硬，从而发明了陶器。陶器的出现极大地改善了人类的生活质量。</p><h3>功能与影响</h3><p>陶器主要用于储存水和食物、烹饪以及运输液体。它使得食物的保存时间更长，烹饪方式更多样化，也促进了定居生活的发展。陶器的制作和装饰还反映了当时的文化和艺术水平。",
        "type": "world"
    },
    {
        "year": "约公元前6500年",
        "title": "查塔霍裕克定居点",
        "description": "位于今土耳其的查塔霍裕克是新石器时代晚期的重要定居点，展现了复杂的社会结构。",
        "expandedDescription": "<h3>新石器时代的奇迹</h3><p>查塔霍裕克是位于土耳其安纳托利亚高原南部的一个新石器时代和铜石并用时代（约公元前7500年至公元前5700年）的大型定居点。它是研究早期农业社会和城市发展的关键遗址之一。</p><h3>独特的城市规划</h3><p>该遗址以其密集的房屋群而闻名，房屋紧密相连，没有街道，人们通过屋顶和梯子进入房屋。房屋内部装饰有精美的壁画，描绘了狩猎、宗教仪式和日常生活场景。这表明当时的社会具有较高的组织性和丰富的精神文化生活。</p><h3>社会与宗教</h3><p>查塔霍裕克没有发现明显的公共建筑或宫殿，暗示其社会结构可能相对平等。然而，大量的女性雕塑和壁画中的宗教符号表明，女神崇拜或丰产崇拜在社会中占有重要地位。</p>",
        "type": "world"
    },
    {
        "year": "约公元前5000年",
        "title": "灌溉农业出现",
        "description": "人类开始修建灌溉系统，将水引入农田，大大提高了农业产量，支持了人口增长。",
        "expandedDescription": "<h3>水利工程的起源</h3><p>随着人口增长和对粮食需求的增加，简单的雨水农业已无法满足需要。人们开始利用河流、泉水等水源，修建沟渠、堤坝等灌溉设施，将水引入农田。</p><h3>对文明的影响</h3><p>灌溉农业的出现极大地提高了土地的生产力，使得在干旱或半干旱地区也能进行大规模农业生产。这为人口的快速增长和城市的兴起提供了物质基础。同时，建设和维护复杂的灌溉系统也需要高度的组织和管理能力，促进了早期国家和官僚制度的形成。</p>",
        "type": "world"
    },
    {
        "year": "约公元前4500年",
        "title": "冶金术出现 (金石并用时代)",
        "description": "人类开始使用天然金属（如金、银、铜）制作工具和装饰品，标志着金石并用时代的开始。",
        "expandedDescription": "<h3>金属时代的黎明</h3><p>金石并用时代是新石器时代和青铜时代之间的过渡期。这一时期，人类开始使用天然存在的金属，如金、银和铜。最初，这些金属主要用于制作装饰品和仪式用品。</p><h3>技术发展</h3><p>随着时间推移，人们学会了从矿石中提炼金属，并开始用锤击或铸造的方法制作工具和武器。虽然石器仍是主要的生产工具，但金属制品的出现预示着一个新时代的到来。",
        "type": "world"
    },
    {
        "year": "约公元前3500年",
        "title": "文字发明 (楔形文字)",
        "description": "苏美尔人在美索不达米亚发明了楔形文字，这是人类历史上最早的文字系统之一。",
        "expandedDescription": "<h3>最早的文字系统</h3><p>苏美尔人发明了人类历史上最早的文字系统——楔形文字。这种文字最初是为了记录商业交易而发展起来的，后来逐渐用于记录法律、宗教、文学和科学等方面的内容。楔形文字的发明是人类文明发展的重要里程碑，它使信息的记录和传播变得更加高效。</p><h3>美索不达米亚文明的兴起</h3><p>美索不达米亚文明是人类历史上最早的文明之一，兴起于底格里斯河和幼发拉底河之间的平原地区（今伊拉克）。约公元前3500年，苏美尔人在此建立了一系列城市国家，如乌鲁克、乌尔和拉格什等。这些城市国家发展出了复杂的社会结构、宗教信仰和政治制度。</p><h3>社会与政治结构</h3><p>苏美尔城市国家的社会结构分为多个阶层，包括祭司、贵族、自由民和奴隶。政治上，每个城市国家都有自己的统治者，称为“恩西”或“卢伽尔”。这些统治者既是政治领袖，也是宗教领袖。苏美尔人还发展出了最早的法律体系之一，如《乌尔纳姆法典》。</p><h3>宗教与文化</h3><p>苏美尔人信仰多神教，他们崇拜的神灵包括天神安努、地神恩利尔、水神恩基和生育女神伊南娜等。他们建造了高大的神庙，称为“吉库拉塔”，作为神灵的居所。苏美尔文化对后来的巴比伦和亚述文明产生了深远影响，其神话、史诗和文学作品被广泛传承。</p><h3>科技与发明</h3><p>苏美尔人在科技领域取得了许多重要成就。他们发明了轮子、帆船和犁等工具，发展了灌溉系统，提高了农业生产力。在数学方面，他们使用六十进制系统，这一系统至今仍在时间和角度的测量中使用。此外，苏美尔人还制定了最早的历法之一。</p>",
        "type": "world"
    },
    {
        "year": "约公元前3200年",
        "title": "古埃及象形文字形成",
        "description": "早期埃及象形文字开始出现，用于记录宗教、行政和历史事件，是人类最早的文字系统之一。",
        "expandedDescription": "<h3>神圣的文字</h3><p>古埃及象形文字是古埃及文明的重要组成部分，起源于公元前3200年左右。它是一种兼具表意和表音功能的复杂文字系统，最初主要刻写在神庙墙壁、石碑和纸草上，用于记录宗教仪式、法老功绩、行政命令和日常生活。</p><p>象形文字的形成与古埃及国家的统一和王权建立密切相关，为中央集权的统治提供了重要的管理工具。</p>",
        "type": "world"
    },
    {
        "year": "约公元前3100年",
        "title": "埃及统一",
        "description": "美尼斯统一上下埃及，建立了第一王朝，开启了法老时代，埃及文明进入鼎盛期。",
        "expandedDescription": "<h3>法老时代的开端</h3><p>约公元前3100年，美尼斯统一了上下埃及，建立了第一王朝，标志着古埃及文明的正式开始。在此之前，埃及分为两个独立的王国：上埃及（尼罗河谷地）和下埃及（尼罗河三角洲）。美尼斯的统一使埃及成为一个中央集权的国家，为后来的文明繁荣奠定了基础。</p><h3>政治与社会结构</h3><p>古埃及的政治制度以法老为核心，法老被视为神的化身，拥有绝对权力。法老之下是庞大的官僚体系，负责管理国家事务。社会结构分为多个阶层，包括法老、贵族、祭司、官吏、工匠和农民。奴隶也存在于社会底层，但数量相对较少。</p><h3>宗教与信仰</h3><p>古埃及宗教是多神教，崇拜众多神灵，如太阳神拉、冥王奥西里斯、智慧神托特和爱神哈索尔等。埃及人相信死后的生命，因此发展出了复杂的木乃伊制作技术和墓葬习俗。金字塔就是为法老建造的陵墓，象征着他们对永生的追求。</p><h3>文化与科技</h3><p>古埃及人创造了象形文字，这是一种复杂的文字系统，用于记录宗教、历史和日常生活。他们还发展了数学、天文学和医学等学科。埃及的建筑成就尤为突出，金字塔、神庙和方尖碑等建筑至今仍令人惊叹。此外，埃及的艺术、雕塑和绘画也达到了很高的水平。</p><h3>历史分期</h3><p>古埃及历史通常分为三个主要时期：古王国时期（约公元前2686-2181年）、中王国时期（约公元前2055-1650年）和新王国时期（约公元前1550-1070年）。每个时期都有其独特的政治、文化和艺术特征。</p>",
        "type": "world"
    },
    {
        "year": "约公元前3300年",
        "title": "青铜时代开始",
        "description": "人类学会将铜和锡熔合制成青铜，青铜工具和武器比石器更坚硬、锋利，耐用性更强。",
        "expandedDescription": "<h3>合金技术的突破</h3><p>青铜是铜和锡（有时也含有铅）的合金。与纯铜相比，青铜更坚硬、更耐磨，铸造性能也更好。青铜时代的开始标志着金属加工技术的重大进步。</p><h3>对社会的影响</h3><p>青铜工具和武器的出现极大地提高了生产效率和军事力量。农业工具如青铜犁、锄头更加耐用，促进了农业发展。青铜武器则改变了战争的形态。青铜器的制造需要专门的技术和原料，促进了手工业的发展和社会分工，也导致了财富和权力的集中。",
        "type": "world"
    },
    {
        "year": "约公元前2600年",
        "title": "金字塔建造",
        "description": "埃及古王国时期开始大规模建造金字塔，作为法老的陵墓，体现了其强大的国力和精湛的建筑技术。",
        "expandedDescription": "<h3>永恒的象征</h3><p>金字塔是古埃及文明最著名的标志之一，主要建造于古王国时期（约公元前2686-2181年）。它们是为法老及其王后建造的陵墓，体现了古埃及人对死后永生的信仰和对法老神圣地位的尊崇。</p><h3>建筑奇迹</h3><p>最著名的金字塔群位于吉萨高原，包括胡夫金字塔（大金字塔）、哈夫拉金字塔和门卡乌拉金字塔。胡夫金字塔是古代世界七大奇迹中唯一保存至今的建筑，其巨大的规模、精确的方位和复杂的内部结构至今仍令人惊叹。</p><h3>社会动员</h3><p>金字塔的建造需要动员巨大的人力、物力和组织能力。这表明古埃及拥有强大的中央政府、发达的农业经济和高度组织化的社会结构。金字塔不仅是建筑杰作，也是国家权力和工程能力的象征。</p>",
        "type": "world"
    },
    {
        "year": "约公元前2333年",
        "title": "尧舜禹时代",
        "description": "传说中的中国上古圣王时代，实行禅让制，大禹治水有功，奠定夏朝基础。",
        "expandedDescription": "<h3>传说时代</h3><p>尧、舜、禹是中国古代传说中上古时期的三位圣王。他们生活的时代大约在公元前24世纪至公元前21世纪，被认为是中华文明的早期奠基者。</p><h3>禅让与治水</h3><p>相传尧年老时，征求各部落首领的意见，推举舜为继承人。舜继位后，也用同样的方式推荐禹。这种部落联盟首领传贤不传子的方式，史称“禅让制”。禹最著名的功绩是治理洪水，他采用疏导的方法，历经十三年，三过家门而不入，最终制服了洪水，赢得了人民的尊敬。</p><h3>历史意义</h3><p>尧舜禹时代是中国古代历史由传说向信史过渡的重要阶段。虽然缺乏直接的考古证据，但这些传说反映了早期中国社会的组织形式和价值观念，如德治、选贤任能等。大禹治水的成功也为夏朝的建立奠定了基础。",
        "type": "china"
    },
    {
        "year": "约公元前2070年",
        "title": "夏朝建立",
        "description": "禹的儿子启继承王位，建立夏朝，标志着中国历史上第一个王朝和世袭制的开始。",
        "expandedDescription": "<h3>家天下的开端</h3><p>约公元前2070年，禹的儿子启继承了父亲的权位，建立了夏朝。这标志着中国历史上“禅让制”的结束和“世袭制”（家天下）的开始，是中国进入奴隶社会的标志。</p><h3>早期国家</h3><p>夏朝是中国历史上第一个王朝，虽然至今尚未发现直接的文字证据（如夏朝同时期的文字记录），但二里头文化等考古发现为夏朝的存在提供了有力支持。夏朝的政治制度、社会结构和文化发展，为后来的商、周王朝奠定了基础。</p><h3>重要遗址</h3><p>河南偃师的二里头遗址被认为是夏朝的都城之一。遗址中发现了大型宫殿基址、青铜器（如爵、斝）、玉器等，表明当时已出现阶级分化和国家机器。此外，二里头遗址还发现了宫殿建筑群和城墙遗迹，表明当时已经形成了城市和国家的雏形。",
        "type": "china"
    },
    {
        "year": "约公元前2000年",
        "title": "古印度哈拉帕文明衰落",
        "description": "印度河谷文明（哈拉帕文明）进入衰落期，其城市体系和文化逐渐解体，原因可能与气候变化或雅利安人迁徙有关。",
        "expandedDescription": "<h3>辉煌的城市文明</h3><p>印度河谷文明，又称哈拉帕文明（约公元前2500年-公元前1900年），是世界四大文明之一。其代表性城市包括摩亨佐-达罗和哈拉帕，拥有先进的城市规划、完善的排水系统和统一的度量衡。然而，约公元前2000年左右，该文明开始衰落，大型城市被废弃。</p><p>衰落的原因尚无定论，可能与气候变化导致的河流改道、农业减产，以及后来雅利安人的迁徙和冲击有关。这一衰落为后续的吠陀文明奠定了基础。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1800年",
        "title": "克里特岛米诺斯文明兴盛",
        "description": "克里特岛上的米诺斯文明进入鼎盛时期，以宏伟的宫殿建筑（如克诺索斯宫）、精美的壁画和航海贸易闻名。",
        "expandedDescription": "<h3>爱琴海的摇篮</h3><p>米诺斯文明（约公元前2700年-公元前1450年）是欧洲最早的先进文明，主要分布在爱琴海的克里特岛上。约公元前1800年，该文明达到鼎盛。</p><p>米诺斯文明没有防御工事，表明其可能是一个和平的海洋贸易帝国。其代表性遗址是克诺索斯宫，拥有复杂的建筑结构、鲜艳的壁画和先进的供水系统。米诺斯文明对后来的迈锡尼文明和古希腊文明产生了深远影响。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1792年",
        "title": "汉谟拉比法典颁布",
        "description": "古巴比伦国王汉谟拉比颁布了著名的《汉谟拉比法典》，是世界上现存最早的成文法典之一。",
        "expandedDescription": "<h3>法律的里程碑</h3><p>《汉谟拉比法典》是古巴比伦国王汉谟拉比（约公元前1792-1750年在位）颁布的一部法律汇编，刻在一块黑色玄武岩石柱上，现存于巴黎卢浮宫。</p><h3>内容与原则</h3><p>法典共282条，内容涉及刑事、民事、婚姻、商业等各个方面。它以“以眼还眼，以牙还牙”（同态复仇）的原则著称，体现了当时社会严格的等级制度。法典序言宣称其目的是为了“发扬正义于世”、“消灭不法邪恶之人”。</p><h3>历史意义</h3><p>《汉谟拉比法典》是研究古巴比伦社会的重要文献，也是人类历史上第一部比较完整保存下来的成文法典。它对后世的法律制度产生了深远影响，体现了早期人类对法律和正义的思考。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1600年",
        "title": "商朝建立",
        "description": "商汤灭夏桀，建立商朝，是中国历史上第二个王朝，以青铜器和甲骨文闻名。",
        "expandedDescription": "<h3>信史时代的开端</h3><p>商朝（约公元前1600年-约公元前1046年）是中国历史上第二个有文献可考、并为考古学和甲骨文所证实的王朝。商朝的建立标志着中国进入了有文字记载的信史时代。</p><h3>青铜文明</h3><p>商朝是中华文明的青铜时代鼎盛期。商代青铜器制作精美，种类繁多，包括礼器、兵器、工具和生活用具。著名的后母戊鼎（司母戊鼎）是商代青铜器的杰出代表。</p><h3>甲骨文</h3><p>商朝留下了大量刻在龟甲和兽骨上的文字——甲骨文。这是中国已发现的古代文字中时代最早、体系较为完整的文字。甲骨文的发现和解读，为研究商朝的政治、经济、文化和社会生活提供了宝贵的第一手资料。</p><h3>社会与信仰</h3><p>商朝社会等级森严，王权与神权紧密结合。商王通过占卜来决定国家大事，祭祀是国家政治生活的重要组成部分。商朝已出现初步的城市和市场，手工业和商业有所发展。",
        "type": "china"
    },
    {
        "year": "约公元前1600年",
        "title": "迈锡尼文明兴起",
        "description": "希腊本土的迈锡尼文明兴起，逐渐取代米诺斯文明，以强大的军事力量和线性文字B闻名。",
        "expandedDescription": "<h3>希腊大陆的霸主</h3><p>迈锡尼文明（约公元前1600年-约公元前1100年）是青铜时代晚期希腊大陆的统治性文明。它继承并发展了米诺斯文明的一些元素，但更具军事扩张性。</p><p>迈锡尼人在各地区建立了独立的城邦，如迈锡尼、提林斯和皮洛斯，这些城邦都建有防御坚固的宫殿。他们使用线性文字B（一种早期希腊语文字）进行行政记录。特洛伊战争的传说也与迈锡尼文明的晚期有关。约公元前12世纪，迈锡尼文明因不明原因（可能包括内部冲突、多利安人入侵或气候变化）而衰落，希腊进入“黑暗时代”。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1500年",
        "title": "奥尔梅克文明兴起",
        "description": "奥尔梅克文明在中美洲（今墨西哥湾沿岸）兴起，被认为是该地区“文明之母”，影响了后来的玛雅和阿兹特克文明。",
        "expandedDescription": "<h3>美洲文明的先驱</h3><p>奥尔梅克文明（约公元前1500年-公元前400年）是中美洲最早的复杂文明之一，其影响力遍及墨西哥中部和南部。奥尔梅克人以其巨大的玄武岩头像雕塑、复杂的宗教信仰、金字塔建造和早期文字系统而闻名。</p><p>他们对中美洲的后续文明，如玛雅文明和阿兹特克文明，在艺术、宗教、历法和文字等方面产生了深远的影响，因此常被称为“中美洲文明之母”。</p>",
        "type": "world"
    },
    {
        "year": "约公元前1200年",
        "title": "特洛伊战争",
        "description": "传说中希腊联军远征小亚细亚的特洛伊城，持续十年，成为西方文学的重要题材。",
        "expandedDescription": "<h3>史诗与历史</h3><p>特洛伊战争是古希腊传说中的一场重要战争，大约发生在公元前12-13世纪。这场战争因荷马史诗《伊利亚特》和《奥德赛》而广为人知，成为西方文学和艺术的不朽题材。</p><h3>战争起因</h3><p>传说战争的起因是特洛伊王子帕里斯拐走了斯巴达王后海伦。希腊各城邦组成联军，在阿伽门农的率领下远征特洛伊，战争持续了十年。</p><h3>考古证据</h3><p>现代考古学在土耳其的希萨尔基莱发掘出了特洛伊古城的遗址，证实了这座城市的存在和毁灭。虽然具体的战争细节仍有争议，但考古发现表明该地区在青铜时代晚期确实发生过冲突和破坏。",
        "type": "world"
    },
    {
        "year": "约公元前1100年",
        "title": "铁器时代开始",
        "description": "人类开始掌握冶铁技术，铁器比青铜器更坚硬、廉价，极大地推动了生产力发展和社会变革。",
        "expandedDescription": "<h3>铁的力量</h3><p>铁器时代标志着人类开始大规模使用铁制工具和武器。铁矿资源比铜、锡更为丰富，冶铁技术的普及使得工具和武器的成本大大降低，质量却显著提高。</p><h3>对文明的影响</h3><p>铁器的广泛应用极大地提高了农业和手工业的生产效率。铁犁、铁锄等农具使人们能够开垦更坚硬的土地，扩大耕地面积。铁制武器也改变了战争的格局。铁器时代的到来促进了人口增长、贸易发展和城市化进程，为古典文明的兴起奠定了基础。",
        "type": "world"
    },
    {
        "year": "公元前1046年",
        "title": "周朝建立",
        "description": "周武王伐纣，建立周朝，实行分封制，是中国历史上统治时间最长的王朝。",
        "expandedDescription": "<h3>封建制度的建立</h3><p>周朝（公元前1046年-公元前256年）是中国历史上统治时间最长的王朝，分为西周（公元前1046年-公元前771年）和东周（公元前770年-公元前256年）两个时期。</p><h3>分封制与宗法制</h3><p>周朝建立后，周武王及其弟周公旦在政治上推行分封制，将土地和人民分封给王室成员和功臣，建立诸侯国，拱卫王室。同时确立了以嫡长子继承制为核心的宗法制度，规范了贵族内部的等级秩序，巩固了周天子的统治。</p><h3>礼乐文化</h3><p>周朝还发展了独特的礼乐文化，用以维护社会秩序和等级制度。礼乐制度不仅是政治制度的体现，也深刻影响了中国人的行为规范和道德观念。西周时期是青铜文化的鼎盛期，也是中国早期思想文化发展的重要时期。</p>",
        "type": "china"
    },
    {
        "year": "约公元前1000年",
        "title": "古印度吠陀时代开始",
        "description": "雅利安人进入印度次大陆，带来吠陀文化，形成种姓制度和早期婆罗门教思想。",
        "expandedDescription": "<h3>雅利安人的到来</h3><p>吠陀时代（约公元前1500年/1000年-公元前600年）是古印度历史的重要阶段。在此期间，雅利安人迁徙至印度次大陆，并将他们的文化、语言（梵语）和宗教信仰（吠陀教）带入。这一时期留下了大量口传经典，即《吠陀经》。</p><p>吠陀社会逐渐形成了森严的种姓制度（瓦尔纳制度），将人口分为婆罗门（祭司）、刹帝利（武士）、吠舍（农民、商人）和首陀罗（仆役），对后来的印度社会产生了持久影响。早期婆罗门教思想也在此阶段奠定。</p>",
        "type": "world"
    },
    {
        "year": "公元前771年",
        "title": "西周灭亡",
        "description": "犬戎攻破镐京，杀死周幽王，西周结束。周平王东迁洛邑，东周开始。",
        "expandedDescription": "<h3>烽火戏诸侯</h3><p>西周末年，周幽王（前782年-前771年在位）昏庸无道，为博宠妃褒姒一笑，多次点燃烽火台，戏弄前来救援的诸侯。烽火是紧急军情的信号，诸侯屡次被骗后不再信任。</p><h3>国破君亡</h3><p>当犬戎真的进攻镐京（今陕西西安）时，周幽王再次点燃烽火，但诸侯以为是戏耍，无人前来救援。镐京被攻破，周幽王被杀于骊山之下，西周灭亡。</p><h3>平王东迁</h3><p>公元前771年，申侯（申国国君，褒姒之父）联合缯国和犬戎杀死了周幽王。不久后，诸侯拥立周幽王之子宜臼为王，是为周平王。公元前770年，周平王将都城从镐京迁至洛邑（今河南洛阳），东周开始。东周又分为春秋和战国两个时期。",
        "type": "china"
    },
    {
        "year": "公元前753年",
        "title": "罗马建城 (传统日期)",
        "description": "根据罗马神话，由罗慕路斯与雷穆斯建立，后发展为罗马共和国和罗马帝国。",
        "expandedDescription": "<h3>永恒之城的诞生</h3><p>根据罗马神话和传统，罗马城建立于公元前753年4月21日，由罗慕路斯和他的孪生兄弟雷穆斯所建。传说他们是由一只母狼抚养长大的。</p><h3>早期发展</h3><p>罗马城建立初期是一个小城邦，经历了王政时代（公元前753年-公元前509年）。在经历了七位国王的统治后，罗马人推翻了最后一位国王塔克文，建立了共和国。</p><h3>历史意义</h3><p>罗马城的建立是罗马文明的起点。从一个意大利中部的小城邦，罗马最终发展成为横跨欧亚非三洲的庞大帝国，其法律、建筑、语言和文化对后世产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元前594年",
        "title": "梭伦改革",
        "description": "雅典执政官梭伦推行一系列政治和经济改革，为雅典民主政治奠定了基础。",
        "expandedDescription": "<h3>雅典民主的基石</h3><p>梭伦（约公元前638年-公元前558年）是古希腊雅典的政治家、立法者和诗人。公元前594年，他被选为雅典的执政官，面对严重的社会危机，推行了一系列重要的改革。</p><h3>改革内容</h3><p>梭伦改革的主要内容包括：颁布“解负令”，取消债务奴隶制；按财产多少将公民分为四个等级，不同等级享有不同的政治权利；设立新的政权机构，如四百人会议和陪审法庭；鼓励工商业发展等。</p><h3>历史影响</h3><p>梭伦改革缓解了平民与贵族之间的矛盾，稳定了雅典的社会秩序，并为后来克里斯提尼的民主改革奠定了基础。梭伦被誉为雅典民主政治的奠基人之一。",
        "type": "world"
    },
    {
        "year": "公元前551年",
        "title": "孔子诞生",
        "description": "中国古代伟大的思想家、教育家孔子出生，其思想对中国乃至东亚文化产生了深远影响。",
        "expandedDescription": "<h3>至圣先师</h3><p>孔子（公元前551年-公元前479年），名丘，字仲尼，春秋时期鲁国陬邑（今山东曲阜）人。他是中国古代伟大的思想家、政治家、教育家，儒家学派的创始人。</p><h3>核心思想</h3><p>孔子的核心思想是“仁”。“仁”是爱人，是处理人际关系的最高准则。他还强调“礼”，主张恢复西周的礼制，以维护社会秩序。在教育上，孔子提倡“有教无类”、“因材施教”，打破了贵族对教育的垄断。</p><h3>深远影响</h3><p>孔子的思想经过后世儒家学者的发扬，成为中国传统文化的主流，深刻影响了中国的政治、文化、教育和社会伦理。儒家思想后来传播到朝鲜、日本、越南等国，形成了东亚儒家文化圈。孔子被后世尊称为“至圣先师”、“万世师表”。</p>",
        "type": "china"
    },
    {
        "year": "公元前509年",
        "title": "罗马共和国建立",
        "description": "罗马人推翻王政，建立共和制国家，权力由元老院、执政官和公民大会掌握。",
        "expandedDescription": "<h3>共和国的诞生</h3><p>公元前509年，罗马公民推翻了其最后一位国王卢修斯·塔克文·高傲的暴政，建立了罗马共和国。共和制下，权力不再集中于一人之手，而是由元老院（一个由贵族组成的咨询机构）、两名每年选举的执政官（行使行政和军事大权）以及公民大会共同掌握。这标志着罗马从城邦王国向强大共和国的转变。</p><p>在共和时期，罗马通过一系列对外战争和内部改革，逐渐征服了整个意大利，并扩展到地中海世界，成为一个庞大的强权。罗马法在此阶段得到发展，对后世法律体系影响深远。</p>",
        "type": "world"
    },
    {
        "year": "公元前431年",
        "title": "伯罗奔尼撒战争",
        "description": "雅典为首的提洛同盟与斯巴达为首的伯罗奔尼撒同盟爆发大规模战争，深刻影响了古希腊历史。",
        "expandedDescription": "<h3>希腊世界的内战</h3><p>伯罗奔尼撒战争是公元前431年至公元前404年间，以雅典为首的提洛同盟与以斯巴达为首的伯罗奔尼撒同盟之间爆发的一场大规模战争。</p><h3>战争过程</h3><p>战争大致分为三个阶段：阿基达姆斯战争、西西里远征和伊奥尼亚战争。战争持续了27年，双方消耗巨大，最终以雅典的失败和斯巴达的胜利告终。</p><h3>深远影响</h3><p>这场战争极大地削弱了希腊各城邦的力量，结束了雅典的黄金时代，也标志着希腊古典时代的衰落。战争的残酷性和复杂性被修昔底德在其著作《伯罗奔尼撒战争史》中详细记录，成为后世研究国际关系和战争的经典。</p>",
        "type": "world"
    },
    {
        "year": "公元前356年",
        "title": "亚历山大大帝诞生",
        "description": "马其顿国王腓力二世之子亚历山大出生，他后来创建了横跨欧亚非三洲的庞大帝国。",
        "expandedDescription": "<h3>征服者的起点</h3><p>亚历山大三世，即亚历山大大帝，出生于公元前356年的马其顿王国首都佩拉。</p><h3>师从亚里士多德</h3><p>亚历山大少年时师从著名哲学家亚里士多德，接受了良好的教育，培养了他对科学、哲学和文学的兴趣，也为他后来的征服事业奠定了思想基础。</p><h3>传奇一生</h3><p>公元前336年，亚历山大继承父位，成为马其顿国王。他迅速稳定了国内局势，并开始了东征。在短短十几年内，他征服了波斯帝国、埃及、中亚，甚至远征至印度河流域，建立了一个横跨欧亚非三洲的庞大帝国，传播了希腊文化（希腊化时代）。</p>",
        "type": "world"
    },
    {
        "year": "公元前338年",
        "title": "商鞅变法",
        "description": "秦国商鞅推行两次变法，废除井田制，奖励耕战，极大地增强了秦国国力。",
        "expandedDescription": "<h3>强秦之路</h3><p>商鞅（约公元前395年-公元前338年），原名公孙鞅，卫国人。他在秦孝公（公元前356年-公元前338年在位）的支持下，于公元前356年和公元前350年先后两次在秦国推行变法。</p><h3>变法内容</h3><p>商鞅变法的主要内容包括：废除井田制，承认土地私有，允许土地自由买卖；奖励耕织和军功，打击旧贵族势力；推行县制，加强中央集权；统一度量衡等。</p><h3>历史意义</h3><p>商鞅变法是战国时期最彻底、影响最深远的改革之一。它使秦国迅速强大起来，为后来秦始皇统一六国奠定了坚实的基础。但变法也触犯了旧贵族的利益，商鞅本人最终被车裂而死。</p>",
        "type": "china"
    },
    {
        "year": "公元前256年",
        "title": "秦灭周",
        "description": "秦国攻灭东周，周赧王卒，周朝正式宣告灭亡。",
        "expandedDescription": "<h3>周室衰微</h3><p>东周自周平王东迁洛邑后，王室权威日渐衰落，诸侯势力日益强大，进入了春秋战国时期。周天子名义上仍是天下共主，但实际上已无力控制各诸侯国。</p><h3>秦国崛起</h3><p>战国时期，秦国经过商鞅变法等一系列改革，国力日益强盛，逐渐成为七雄中实力最强的国家。秦昭襄王时期，秦国不断对外扩张，削弱其他诸侯国。</p><h3>周朝终结</h3><p>公元前256年，秦军攻入洛邑，俘虏周赧王，迁其至秦国。同年，周赧王去世，周朝祭祀断绝，历时八百多年的周朝（包括西周和东周）正式灭亡。这为后来秦始皇统一六国扫清了象征性的障碍。</p>",
        "type": "china"
    },
    {
        "year": "公元前221年",
        "title": "秦朝建立，中国首次统一",
        "description": "秦王嬴政统一六国，建立秦朝，自称“始皇帝”，结束春秋战国的分裂局面，开创中国帝制时代。",
        "expandedDescription": "<h3>千古一帝</h3><p>公元前221年，秦王嬴政（即秦始皇，公元前259年-公元前210年）先后灭掉齐、楚、燕、赵、魏、韩六国，结束了春秋战国以来长达数百年的分裂割据局面，建立了中国历史上第一个统一的中央集权王朝——秦朝。</p><h3>制度创新</h3><p>秦始皇废除分封制，实行郡县制，将全国划分为36郡，郡下设县，所有官员由中央任免。他统一文字（小篆）、货币、度量衡，修建驰道、直道，沟通全国交通。对外，他北击匈奴，修筑长城，南征百越，扩大版图。这些措施对中国后世的政治制度和文化发展产生了深远影响。</p><p>秦朝虽然短暂（公元前221年-公元前207年），但其建立的统一多民族中央集权国家模式，为后世王朝所沿用，奠定了中国两千多年的封建帝制基础。</p>",
        "type": "china"
    },
    {
        "year": "公元前206年",
        "title": "汉朝建立 (西汉)",
        "description": "刘邦推翻秦朝统治，建立汉朝（西汉），定都长安，开创中国历史上一个辉煌的时代。",
        "expandedDescription": "<h3>大汉肇始</h3><p>公元前206年，在秦末农民起义和楚汉战争后，刘邦（汉高祖，公元前256年-公元前195年）击败项羽，建立汉朝。因其都城在长安（今西安），史称西汉。汉朝延续了秦朝的中央集权制度，但在初期采取了“休养生息”政策，减轻赋税，发展农业生产。</p><h3>文景之治与汉武盛世</h3><p>西汉初期经历了“文景之治”，社会经济得到恢复和发展。汉武帝刘彻（公元前156年-公元前87年）在位时期，通过“推恩令”削弱诸侯王势力，加强中央集权；对内统一思想，独尊儒术；对外北击匈奴，开通丝绸之路，使汉朝疆域空前辽阔，国力鼎盛，史称“汉武盛世”。汉朝的制度、文化和民族认同对后世产生了深远影响。</p>",
        "type": "china"
    },
    {
        "year": "公元前27年",
        "title": "罗马帝国建立",
        "description": "屋大维被授予“奥古斯都”称号，标志着罗马共和国向罗马帝国的转变，开启了罗马和平时期。",
        "expandedDescription": "<h3>帝国的开端</h3><p>公元前27年，罗马共和国经历了一系列内战和政治动荡后，凯撒的养子屋大维通过权力斗争最终获胜，掌握了最高权力。元老院授予他“奥古斯都”（意为“受尊崇者”）的称号，并赋予他终身执政官、保民官、大祭司等职权。这标志着罗马共和国的结束和罗马帝国的正式建立，也开启了罗马长达200年的和平与繁荣时期——“罗马和平”。</p><h3>奥古斯都的统治</h3><p>奥古斯都在位期间（公元前27年-公元14年），他维持了共和制的表面形式，但实际上集大权于一身。他进行了一系列改革，包括重组军队、稳定边境、发展经济、修建公共建筑等，使罗马帝国达到了其鼎盛时期。他的统治为罗马帝国后来的繁荣奠定了基础，对欧洲文明产生了深远影响。</p>",
        "type": "world"
    },
    {
        "year": "公元8年",
        "title": "王莽建立新朝",
        "description": "西汉外戚王莽夺取政权，建立新朝，史称“王莽篡汉”。",
        "expandedDescription": "<h3>外戚专权</h3><p>西汉后期，元帝、成帝、哀帝、平帝时期，皇权旁落，外戚势力（特别是王氏外戚）相继专权。王莽是汉元帝皇后王政君的侄子，凭借其姑母的地位和自身的政治手腕，逐步掌握了朝政大权。</p><h3>王莽篡汉</h3><p>公元8年，王莽自立为帝，改国号为“新”，建元“始建国”，正式取代了西汉王朝。王莽为了巩固统治，进行了一系列托古改制，如推行井田制、禁止奴婢买卖、改革币制等。</p><h3>新政与失败</h3><p>王莽的改革措施多不切实际，触动了大地主、大商人的利益，加上政策朝令夕改，导致社会混乱，民不聊生。新朝末年，各地农民起义不断，最终在公元23年，绿林军攻入长安，王莽被杀，新朝灭亡。</p>",
        "type": "china"
    },
    {
        "year": "公元25年",
        "title": "东汉建立",
        "description": "刘秀在绿林、赤眉起义推翻新朝后，重建汉朝，定都洛阳，史称东汉。",
        "expandedDescription": "<h3>光武中兴</h3><p>公元23年，绿林、赤眉等农民起义推翻了王莽建立的新朝。公元25年，汉朝宗室刘秀（光武帝，公元前6年-公元57年）在河北称帝，重建汉朝，定都洛阳（今河南洛阳），史称东汉。</p><p>光武帝在位期间，平定割据势力，恢复生产，减轻徭役，裁并郡县，改革官制，史称“光武中兴”，使社会经济得到恢复和发展。东汉延续了西汉的辉煌，在科技（如造纸术的改进）、文化（如史学、佛学传入）和对外交流（如班超经营西域）方面都有显著成就。</p>",
        "type": "china"
    },
    {
        "year": "公元64年",
        "title": "罗马大火",
        "description": "罗马城发生大火，持续6天，摧毁了大半个城市，尼禄皇帝被怀疑纵火。",
        "expandedDescription": "<h3>烈火罗马</h3><p>公元64年7月18日，罗马城发生了一场毁灭性的大火。大火起于马克西穆斯竞技场附近的商店，由于当时正值盛夏，风助火势，且城市建筑多为木制，火势迅速蔓延。</p><h3>扑救与后果</h3><p>大火持续了6天7夜，14个区中有3个区被完全烧毁，7个区部分烧毁，只有4个区幸免于难。无数宫殿、神庙、民居被毁，大量居民无家可归。</p><h3>尼禄与基督徒</h3><p>当时的皇帝尼禄被普遍怀疑是纵火的幕后黑手，甚至有传言称他为了建造“金宫”而故意纵火。为了转移视线，尼禄将罪名嫁祸给基督徒，导致了对基督徒的首次大规模迫害。",
        "type": "world"
    },
    {
        "year": "公元220年",
        "title": "三国鼎立开始 (魏、蜀、吴)",
        "description": "曹丕称帝，标志着东汉灭亡，中国进入魏、蜀、吴三国鼎立的局面。",
        "expandedDescription": "<h3>乱世三国</h3><p>公元220年，曹操之子曹丕（187年-226年）逼迫汉献帝禅位，在洛阳建立曹魏政权。此前，刘备在成都建立蜀汉（221年），孙权在建业（今南京）建立东吴（229年）。至此，中国进入了魏、蜀、吴三国鼎立的局面（220年-280年）。</p><p>三国时期战乱频繁，人口锐减，经济受到严重破坏。但同时，各方政治家、军事家和文学家辈出，如诸葛亮、周瑜、曹植等，留下了丰富的军事思想、文学作品和历史故事。科技方面，马钧的指南车、孔明的木牛流马等也体现了当时的智慧。</p>",
        "type": "china"
    },
    {
        "year": "公元280年",
        "title": "西晋统一中国",
        "description": "晋武帝司马炎灭吴，结束三国鼎立局面，建立西晋，但统一局面短暂。",
        "expandedDescription": "<h3>短暂的统一</h3><p>公元265年，司马懿之孙司马炎（236年-290年）篡魏建立西晋，定都洛阳。公元280年，西晋灭吴，结束了三国鼎立的局面，中国再次实现统一。然而，西晋的统一是短暂的。</p><p>由于分封同姓诸侯王过多、民族矛盾激化以及统治阶级的腐败，西晋在统一后不久就爆发了“八王之乱”，国力大衰。公元316年，永嘉之乱后，匈奴攻占洛阳，西晋灭亡，中国进入长达三百年的南北分裂时期。</p>",
        "type": "china"
    },
    {
        "year": "公元313年",
        "title": "米兰敕令",
        "description": "罗马皇帝君士坦丁一世和李锡尼在米兰颁布敕令，承认基督教的合法地位。",
        "expandedDescription": "<h3>基督教合法化</h3><p>公元313年，罗马皇帝君士坦丁一世和李锡尼在意大利的米兰会晤，联合颁布了《米兰敕令》。</p><h3>敕令内容</h3><p>该敕令宣布，所有臣民都有信仰基督教或其他宗教的自由，基督教在罗马帝国境内获得了合法地位。同时，敕令还规定归还之前因宗教迫害而被没收的基督徒财产。</p><h3>历史意义</h3><p>《米兰敕令》是基督教历史上的一个重大转折点。它结束了罗马帝国对基督教长达几个世纪的官方迫害，使基督教得以合法传播和发展。此后，基督教在罗马帝国境内的影响力迅速扩大，最终成为国教。",
        "type": "world"
    },
    {
        "year": "公元420年",
        "title": "南北朝时期开始",
        "description": "刘裕代晋建立刘宋，标志着中国历史上南北朝时期的开始。",
        "expandedDescription": "<h3>分裂与融合</h3><p>公元420年，东晋将领刘裕（363年-422年）废晋恭帝司马德文，建立刘宋政权，定都建康（今南京）。这标志着中国历史进入了南北朝时期（420年-589年），北方由少数民族建立的多个政权轮替（北魏、东魏、西魏、北齐、北周），南方则由汉族建立的宋、齐、梁、陈四个朝代相继统治。</p><p>南北朝时期虽然战乱频繁，但也是民族大融合和文化大发展的时期。北方民族汉化，南方经济得到开发，佛教盛行，艺术、文学、科技都有显著进步。为隋唐大一统的繁荣奠定了基础。</p>",
        "type": "china"
    },
    {
        "year": "公元476年",
        "title": "西罗马帝国灭亡",
        "description": "日耳曼人奥多亚克废黜西罗马末代皇帝罗慕路斯·奥古斯都，西罗马帝国覆灭。",
        "expandedDescription": "<h3>帝国的黄昏</h3><p>公元3-4世纪，罗马帝国面临严重的政治、军事和经济危机。蛮族（如哥特人、汪达尔人等）不断入侵，帝国分裂为东西两部分。西罗马帝国长期处于风雨飘摇之中。</p><h3>最后的终结</h3><p>公元476年，日耳曼雇佣军首领奥多亚克废黜了西罗马帝国的末代皇帝、年仅14岁的罗慕路斯·奥古斯都，并将西罗马帝国的国徽（王袍和戒指）送往东罗马帝国皇帝芝诺处，表示效忠。这标志着西罗马帝国的正式灭亡。</p><h3>历史意义</h3><p>西罗马帝国的灭亡通常被视为西欧古代历史的终结和中世纪（或称“黑暗时代”）的开始。此后，西欧的政治格局发生了巨大变化，封建制度逐渐形成。而东罗马帝国（拜占庭帝国）则继续存在了近一千年。",
        "type": "world"
    },
    {
        "year": "公元529年",
        "title": "查士丁尼法典颁布",
        "description": "东罗马皇帝查士丁尼一世下令编纂《查士丁尼法典》，是古代法律的集大成者，对后世法学影响深远。",
        "expandedDescription": "<h3>法律的汇编</h3><p>公元529年，在东罗马皇帝查士丁尼一世的主持下，法学家特里波尼安等人编纂完成了《查士丁尼法典》。</p><h3>法学全书</h3><p>《查士丁尼法典》是《国法大全》的一部分，后者还包括《法学阶梯》、《学说汇纂》和《新律》。这套法典系统地整理了自哈德良皇帝（117年-138年）以来历代皇帝的法令和罗马法学家的著作。</p><h3>历史影响</h3><p>《查士丁尼法典》是古代法律的集大成者，它不仅保存了大量罗马法的精华，也为后世欧洲大陆的法律体系奠定了基础。近代以来，欧洲许多国家的民法典都受到了罗马法，特别是《查士丁尼法典》的深刻影响。",
        "type": "world"
    },
    {
        "year": "公元581年",
        "title": "隋朝建立",
        "description": "北周外戚杨坚夺取政权，建立隋朝，定都长安，是为隋文帝。",
        "expandedDescription": "<h3>外戚建朝</h3><p>公元581年，北周静帝宇文阐年幼，大丞相杨坚（541年-604年）总揽朝政。杨坚是北周皇室的外戚，凭借其政治和军事实力，迫使北周静帝禅让，自立为帝，建立隋朝，定都大兴城（今陕西西安），是为隋文帝，改元开皇。</p><h3>统一之路</h3><p>隋朝建立时，中国仍处于南北分裂状态。隋文帝励精图治，进行了一系列政治、经济改革，国力迅速增强。公元589年，隋军渡过长江，攻灭南朝陈国，俘虏陈后主陈叔宝，重新统一了中国。</p><h3>短暂而辉煌</h3><p>隋朝虽然国祚短暂（581年-618年），但在中国历史上具有承前启后的重要作用。它结束了自西晋灭亡（316年）以来长达273年的分裂局面，重新统一了中国。隋文帝和其子隋炀帝开凿了贯通南北的大运河，创立了科举制度，对后世影响深远。</p>",
        "type": "china"
    },
    {
        "year": "公元618年",
        "title": "唐朝建立",
        "description": "李渊在太原起兵，攻占长安，建立唐朝，定都长安，是为唐高祖。",
        "expandedDescription": "<h3>隋末群雄</h3><p>隋朝末年，隋炀帝杨广穷兵黩武，大兴土木（如开凿大运河、修建洛阳城），导致民不聊生，各地农民起义和军阀割据蜂起。李渊（566年-635年）时任太原留守，手握重兵。</p><h3>晋阳起兵</h3><p>公元617年，李渊在次子李世民等人的劝说下，于太原（晋阳）起兵反隋。他拥立隋炀帝孙杨侑为傀儡皇帝（恭帝），自封大丞相、唐王。</p><h3>建立唐朝</h3><p>李渊率军攻占长安后，于公元618年逼迫恭帝杨侑禅让，自立为帝，建立唐朝，定都长安，是为唐高祖，改元武德。唐朝（618年-907年）是中国历史上统一时间最长、国力最强盛的朝代之一。</p><h3>盛世开端</h3><p>唐朝（618年-907年）是中国历史上统一时间最长、国力最强盛的朝代之一。唐太宗李世民（李渊次子）继位后，励精图治，开创了“贞观之治”，为唐朝的繁荣昌盛奠定了基础。</p>",
        "type": "china"
    },
    {
        "year": "公元622年",
        "title": "伊斯兰教兴起",
        "description": "穆罕默德从麦加迁往麦地那，建立政教合一的国家，伊斯兰教纪元由此开始。",
        "expandedDescription": "<h3>先知的迁徙</h3><p>公元622年，伊斯兰教创始人穆罕默德（约570年-632年）因在麦加传教受到当地贵族的迫害，被迫带领信徒迁往麦地那（当时称叶斯里布）。</p><h3>乌玛的建立</h3><p>迁徙到麦地那后，穆罕默德建立了以伊斯兰信仰为纽带的宗教社团（乌玛），并制定了《麦地那宪章》，将麦地那的阿拉伯部落和穆斯林团结起来，形成了一个政教合一的国家雏形。</p><h3>历史纪元</h3><p>穆罕默德的“希吉拉”（迁徙）是伊斯兰教历史上的一个重大转折点，也被定为伊斯兰教历法的元年。此后，伊斯兰教在阿拉伯半岛迅速传播，并随着阿拉伯帝国的扩张传播到更广阔的地区。",
        "type": "world"
    },
    {
        "year": "公元627年",
        "title": "玄奘西行",
        "description": "唐朝高僧玄奘从长安出发，前往天竺（印度）取经，历时17年，对中印文化交流贡献巨大。",
        "expandedDescription": "<h3>求法之旅</h3><p>玄奘（602年-664年），俗姓陈，名祎，唐代著名高僧、翻译家、旅行家。他因感于当时佛经译本不一、义理含混，遂于贞观元年（627年）自长安出发，西行求法。</p><h3>艰难历程</h3><p>玄奘西行历时17年，行程五万余里，途径今天的新疆、中亚、阿富汗、巴基斯坦，最终到达印度。他在印度那烂陀寺学习多年，精通佛教经义，声名远播。</p><h3>载誉归来</h3><p>贞观十九年（645年），玄奘携带大量佛经回到长安。他受到唐太宗的隆重欢迎。此后，玄奘主要从事佛经翻译工作，共译出经论75部，1335卷，是古代中国译经最多的人之一。他的弟子根据其口述写成的《大唐西域记》，是研究中亚和印度古代历史、地理的重要文献。",
        "type": "china"
    },
    {
        "year": "公元646年",
        "title": "大化改新",
        "description": "日本孝德天皇颁布《改新之诏》，仿效唐朝制度进行改革，建立中央集权体制。",
        "expandedDescription": "<h3>改革的背景</h3><p>公元7世纪初，日本社会矛盾尖锐，贵族专权，部民制（类似奴隶制）阻碍了社会生产力的发展。为了加强中央集权，巩固天皇的地位，学习先进的隋唐制度成为必然选择。</p><h3>改新的内容</h3><p>公元645年，中大兄皇子（后来的天智天皇）等人发动政变，铲除了权臣苏我氏。公元646年，孝德天皇即位，颁布《改新之诏》，开始进行改革。主要内容包括：废除氏姓世袭制度，建立中央集权的官僚政治体制；废除部民制，将土地和部民收归国有，实行“公地公民”制；仿照唐朝的均田制和租庸调制，实行“班田收授法”和租庸调制。</p><h3>历史意义</h3><p>大化改新是日本历史上一次重要的社会政治变革，它标志着日本从奴隶社会向封建社会的过渡，建立了以天皇为核心的律令制国家，为日本社会经济的发展奠定了基础。",
        "type": "world"
    },
    {
        "year": "公元751年",
        "title": "怛罗斯之战",
        "description": "唐朝军队与阿拉伯阿拔斯王朝军队在怛罗斯（今哈萨克斯坦）交战，唐军战败，影响了中亚格局。",
        "expandedDescription": "<h3>东西方的碰撞</h3><p>怛罗斯之战发生在公元751年，是唐朝安西都护府的军队与阿拉伯帝国（阿拔斯王朝）及其盟军（主要是葛逻禄部）之间的一场重要战役。</p><h3>战争背景</h3><p>8世纪中叶，唐朝在中亚的势力达到顶峰，控制了葱岭以西的中亚河中地区。与此同时，阿拉伯帝国也在不断东扩。双方势力在中亚地区发生接触和冲突。</p><h3>战争结果与影响</h3><p>怛罗斯之战以唐军的失败告终。虽然这场战役本身规模不算特别大，但它标志着唐朝势力从中亚的进一步退缩。有传说称，唐军中的造纸工匠被俘，将造纸术传入了阿拉伯世界，进而传到欧洲。不过，这一说法在史学界尚有争议。",
        "type": "world"
    },
    {
        "year": "公元755年",
        "title": "安史之乱",
        "description": "节度使安禄山、史思明发动叛乱，是唐朝由盛转衰的转折点，战乱持续八年。",
        "expandedDescription": "<h3>盛世的裂痕</h3><p>安史之乱（755年-763年）是唐朝将领安禄山与史思明背叛唐朝后发动的战争，是唐朝由盛转衰的转折点。</p><h3>叛乱始末</h3><p>安禄山身兼范阳、平卢、河东三镇节度使，手握重兵。他利用唐玄宗的宠信和朝政的腐败，于天宝十四载（755年）在范阳起兵反唐。叛军迅速南下，攻占洛阳、长安，迫使唐玄宗逃往四川。太子李亨在灵武即位，是为唐肃宗，遥尊玄宗为太上皇。</p><h3>深远影响</h3><p>安史之乱持续了八年（755年-763年），战火遍及半个中国，给人民带来了深重的灾难，导致唐朝人口锐减，经济凋敝，中央集权严重削弱，藩镇割据局面形成。此后，唐朝国势一蹶不振，再也无力重现开元盛世的辉煌。",
        "type": "china"
    },
    {
        "year": "公元800年",
        "title": "查理曼加冕",
        "description": "法兰克国王查理曼在罗马由教皇利奥三世加冕为“罗马人的皇帝”，标志着神圣罗马帝国的雏形。",
        "expandedDescription": "<h3>蛮族的皇帝</h3><p>公元800年圣诞节，法兰克王国国王查理曼（742年-814年）在罗马的圣彼得大教堂内，由教皇利奥三世加冕为“罗马人的皇帝”。</p><h3>帝国的复兴</h3><p>查理曼的加冕具有重大的象征意义，它标志着西罗马帝国灭亡后，一个新的“罗马帝国”在西欧的复兴。这个帝国后来被称为“查理曼帝国”或“加洛林帝国”，是神圣罗马帝国的雏形。查理曼也因此被誉为“欧洲之父”。</p><h3>文化与改革</h3><p>查理曼在位期间，不仅致力于军事征服和政治统一，还积极推动文化教育事业。他邀请英格兰学者阿尔昆到宫廷，推动了“加洛林文艺复兴”，促进了古典文化的复兴和基督教文化的传播。</p>",
        "type": "world"
    },
    {
        "year": "公元907年",
        "title": "唐朝灭亡，五代十国开始",
        "description": "朱温篡唐，建立后梁，唐朝灭亡，中国进入长期的分裂割据（五代十国）时期。",
        "expandedDescription": "<h3>晚唐的衰落</h3><p>唐朝后期，由于藩镇割据、宦官专权和农民起义（如黄巢起义）的打击，国力日益衰弱。公元907年，盘踞在河南的藩镇朱温（后梁太祖）废唐哀帝李柷，建立后梁，定都开封。这标志着唐朝的正式灭亡，中国历史进入了长达50多年的五代十国时期。</p><h3>混乱与变革</h3><p>五代十国时期（907年-960年），中原地区先后出现了后梁、后唐、后晋、后汉、后周五个短命的王朝，而在南方和北方则同时存在着十多个割据政权。尽管政治混乱，但这一时期也见证了南方经济的进一步发展，以及雕版印刷术的普及，为宋朝的统一和文化繁荣积累了条件。</p>",
        "type": "china"
    },
    {
        "year": "公元960年",
        "title": "北宋建立",
        "description": "后周禁军将领赵匡胤在陈桥兵变中被拥立为帝，建立宋朝，定都开封，是为宋太祖。",
        "expandedDescription": "<h3>陈桥兵变</h3><p>公元960年正月，后周禁军最高统帅赵匡胤（927年-976年）奉命北上抵御北汉和契丹的联合入侵。当军队行至陈桥驿（今河南封丘东南陈桥镇）时，赵匡胤的部下突然发动兵变，将一件黄袍披在他身上，高呼“万岁”，拥立他为皇帝。</p><h3>黄袍加身</h3><p>赵匡胤随即率军返回开封，后周恭帝柴宗训被迫禅位。赵匡胤顺利夺取政权，建立了宋朝，仍定都开封（时称汴京），是为宋太祖，改元建隆。这一事件史称“陈桥兵变”或“黄袍加身”。</p><h3>杯酒释兵权</h3><p>宋太祖建立宋朝后，为了防止类似兵变再次发生，巩固赵氏王朝的统治，他采取了“重文轻武”的国策。最著名的是“杯酒释兵权”，通过一次宴会，以和平方式解除了石守信等高级将领的兵权，将军事大权集中于皇帝手中，加强了中央集权。",
        "type": "china"
    },
    {
        "year": "公元1054年",
        "title": "东西教会大分裂",
        "description": "罗马天主教会与东正教会因神学和政治分歧正式分裂，形成天主教和东正教。",
        "expandedDescription": "<h3>分歧的根源</h3><p>东西教会（罗马天主教会和君士坦丁堡东正教会）之间的分歧由来已久，涉及神学（如“和子句”争议）、礼仪、语言以及政治权力（罗马教皇权威对比君士坦丁堡牧首地位）等多个方面。</p><h3>分裂事件</h3><p>公元1054年，双方的矛盾达到顶点。罗马教皇利奥九世的代表与君士坦丁堡牧首米海尔·塞鲁拉里乌斯互相开除了对方的教籍。这一事件标志着东西教会的正式决裂。</p><h3>深远影响</h3><p>东西教会大分裂是基督教历史上的重大事件，它将统一的基督教世界一分为二：以罗马为中心的天主教（拉丁礼）和以君士坦丁堡为中心的东正教（希腊礼）。这一分裂至今未能完全弥合，对欧洲乃至世界历史产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1066年",
        "title": "诺曼征服英格兰",
        "description": "诺曼底公爵威廉在黑斯廷斯战役中击败英格兰国王哈罗德二世，加冕为英格兰国王，史称威廉一世。",
        "expandedDescription": "<h3>征服者威廉</h3><p>1066年，英格兰国王爱德华忏悔王去世，无嗣。英格兰贵族哈罗德·戈德温森被选为国王。然而，诺曼底公爵威廉声称爱德华曾许诺王位给他，并得到了教皇的支持。</p><h3>黑斯廷斯决战</h3><p>威廉率军渡过英吉利海峡，在黑斯廷斯与哈罗德二世的军队决战。哈罗德战死，威廉获胜。同年圣诞节，威廉在威斯敏斯特教堂加冕为英格兰国王，开启了诺曼王朝的统治。</p><h3>历史影响</h3><p>诺曼征服对英格兰产生了深远影响。它结束了盎格鲁-撒克逊时代，带来了法国的封建制度、语言和文化。英语中大量吸收了法语词汇，社会结构和法律体系也发生了重大变化。",
        "type": "world"
    },
    {
        "year": "公元1096年",
        "title": "第一次十字军东征开始",
        "description": "响应教皇乌尔班二世的号召，西欧封建主和骑士开始对东方的军事远征。",
        "expandedDescription": "<h3>教皇的号召</h3><p>公元1095年，拜占庭皇帝阿历克塞一世向罗马教皇乌尔班二世求援，希望对抗塞尔柱突厥人的入侵。同年，乌尔班二世在法国克莱芒会议上发表演说，号召西欧基督徒进行一场“圣战”，从穆斯林手中夺回圣地耶路撒冷。</p><h3>十字军的组成</h3><p>响应号召的十字军主要由西欧的封建主、骑士、农民和教士组成。他们佩戴十字标志，因此被称为“十字军”。十字军东征持续了近200年（1096年-1291年），共进行了多次。</p><h3>第一次东征与耶路撒冷王国</h3><p>第一次十字军东征（1096年-1099年）成功攻占了耶路撒冷，并在那里建立了耶路撒冷王国等十字军国家。然而，十字军东征也给东方和西方人民带来了巨大的痛苦和灾难，并加剧了基督教世界与伊斯兰世界的冲突。",
        "type": "world"
    },
    {
        "year": "公元1127年",
        "title": "北宋灭亡，南宋建立",
        "description": "金兵攻陷开封，掳走宋徽宗、钦宗，北宋灭亡。康王赵构南渡建立南宋。",
        "expandedDescription": "<h3>靖康之耻</h3><p>北宋末年，政治腐败，军事积弱。金朝崛起于北方，对宋朝构成严重威胁。公元1127年，金兵大举南下，攻陷北宋都城开封（汴京），俘虏了宋徽宗和宋钦宗父子以及大量皇室成员、官员和百姓，史称“靖康之耻”，北宋灭亡。</p><h3>偏安江南</h3><p>同年，徽宗第九子赵构（宋高宗）在南京（今河南商丘）即位，后迁都临安（今杭州），建立了南宋政权（1127年-1279年）。南宋虽然国土面积大大缩小，但经济文化仍然繁荣，海上贸易发达，科技（如火药、指南针的应用）也有所发展。然而，南宋与金、蒙古长期对峙，最终被元朝所灭。</p>",
        "type": "china"
    },
    {
        "year": "公元1206年",
        "title": "成吉思汗建立蒙古帝国",
        "description": "铁木真统一蒙古各部，在斡难河源头被推举为大汗，建立大蒙古国。",
        "expandedDescription": "<h3>草原上的雄鹰</h3><p>铁木真（约1162年-1227年）出生于蒙古乞颜部贵族家庭，早年经历坎坷，父亲被仇敌毒死，部众离散。但他凭借智慧、勇气和领导才能，逐渐收集旧部，招揽人才。</p><h3>统一蒙古</h3><p>经过一系列战争，铁木真先后击败了札木合、王汗、乃蛮等强大的对手，统一了蒙古高原上的各个部落。</p><h3>大汗登基</h3><p>公元1206年春，在斡难河（今鄂嫩河）源头召开的忽里勒台（大会）上，铁木真被推举为蒙古大汗，尊号“成吉思汗”，建立了大蒙古国。这标志着蒙古帝国的正式建立。</p><h3>征服的序幕</h3><p>成吉思汗统一蒙古后，立刻开始了大规模的对外征服战争。他和他的子孙们在几十年内，将蒙古帝国扩张为历史上疆域最辽阔的帝国，其版图横跨欧亚大陆。",
        "type": "world"
    },
    {
        "year": "公元1215年",
        "title": "《大宪章》签署",
        "description": "英格兰国王约翰被迫签署《大宪章》，限制王权，保障贵族特权，是英国宪政发展的重要里程碑。",
        "expandedDescription": "<h3>王权与贵族的较量</h3><p>公元1215年，英格兰国王约翰在连年的对外战争失败和国内横征暴敛引发的贵族、教会和平民的普遍不满中，被迫在兰尼米德与反叛的贵族进行谈判。</p><h3>自由大宪章</h3><p>谈判的结果是签署了《大宪章》（意为“伟大的宪章”）。《大宪章》共63条，主要内容包括：保障教会选举教职人员的自由；保护贵族和骑士的采邑继承权；限制国王随意征税；承认伦敦和其他城市的自由；统一度量衡等。最重要的是，它规定国王也必须遵守法律，不得任意侵犯臣民的权利。</p><h3>宪政基石</h3><p>《大宪章》虽然主要是为了保护封建贵族的利益，但它首次以法律形式限制了王权，确立了“王在法下”的原则，成为英国乃至世界宪政发展史上的重要里程碑。它为后来的议会制度和法治传统奠定了基础。",
        "type": "world"
    },
    {
        "year": "公元1271年",
        "title": "元朝建立/马可·波罗东游",
        "description": "蒙古大汗忽必烈定国号为“大元”，定都大都；马可·波罗开始东行之旅。",
        "expandedDescription": "<h3>蒙古征服与统治</h3><p>成吉思汗及其子孙发动的对外征服战争，使蒙古帝国的疆域空前辽阔。忽必烈（1215年-1294年）是成吉思汗的孙子，拖雷的第四子。他在继承汗位后，继续完成对南宋的征服。</p><h3>建立元朝</h3><p>公元1271年，忽必烈取《易经》“大哉乾元”之意，定国号为“大元”，定都燕京（后称大都，今北京），是为元世祖。公元1279年，元军在崖山海战中击败南宋残余势力，陆秀夫负幼帝赵昺投海，南宋灭亡，元朝统一中国。</p><h3>统治与融合</h3><p>元朝是中国历史上第一个由少数民族（蒙古族）建立的大一统王朝。忽必烈推行汉法，采用中原王朝的统治方式，促进了民族融合和经济发展。同时，元朝的版图也达到了中国古代历史上的最大范围。</p><h3>东西方的桥梁</h3><p>公元1271年，威尼斯商人马可·波罗与其父亲、叔叔一起，从地中海东岸出发，沿着丝绸之路，经过中亚，历时约四年，于1275年抵达元上都，受到忽必烈的接见。他在元朝生活了约17年，游历了中国各地。他的游记《马可·波罗游记》向欧洲人展示了富庶的东方世界，对后来的地理大发现产生了重要影响。",
        "type": "world"
    },
    {
        "year": "公元1279年",
        "title": "崖山海战，南宋灭亡",
        "description": "元军在崖山海战中击败南宋残余势力，陆秀夫负幼帝赵昺投海，南宋灭亡。",
        "expandedDescription": "<h3>最后的抵抗</h3><p>公元1276年，元军攻占南宋都城临安（今杭州），俘虏了宋恭帝。但南宋残余势力在陆秀夫、张世杰、文天祥等人的领导下，继续在南方坚持抵抗，先后拥立了两个幼主（端宗赵昰、帝昺），建立了流亡小朝廷。</p><h3>崖山决战</h3><p>公元1279年春，元军将领张弘范率军包围了南宋流亡朝廷所在的崖山（今广东江门新会区）。宋军在张世杰的指挥下，将千余艘战船用大绳连结，碇泊于海中，形成“连环船”阵。元军用火攻战术，切断了宋军的淡水补给，并发动总攻。</p><h3>国破家亡</h3><p>崖山海战以宋军的惨败告终。左丞相陆秀夫见大势已去，先让妻子儿女投海自尽，然后身穿朝服，背负年仅8岁的少帝赵昺投海殉国。许多忠臣和军民也纷纷跳海，史载“浮尸出于海十余万人”。至此，南宋彻底灭亡，元朝统一了中国。",
        "type": "china"
    },
    {
        "year": "公元1337年",
        "title": "英法百年战争开始",
        "description": "因法国王位继承问题和领土争端，英法两国爆发长达百年的战争。",
        "expandedDescription": "<h3>王位继承争议</h3><p>公元1328年，法国卡佩王朝绝嗣，王位继承问题引发争议。英王爱德华三世（其母为法王腓力四世之女）和法王腓力六世（瓦卢瓦家族）都宣称有权继承法国王位。此外，英法两国在佛兰德斯和阿基坦等地区的领土争端也由来已久。</p><h3>战争爆发</h3><p>公元1337年，腓力六世宣布收回英王在法国的领地阿基坦公国，爱德华三世则正式自称为法国国王，英法百年战争（1337年-1453年）正式爆发。</p><h3>战争进程与影响</h3><p>百年战争断断续续进行了116年，期间经历了多个阶段。战争中涌现出许多传奇人物和战役，如圣女贞德、克雷西战役、普瓦捷战役、阿金库尔战役等。这场战争对英法两国的政治、军事、社会和民族意识都产生了深远影响，最终以法国的胜利告终。",
        "type": "world"
    },
    {
        "year": "公元1347年",
        "title": "黑死病爆发",
        "description": "鼠疫（黑死病）在欧洲爆发，造成约三分之一人口死亡，深刻改变了欧洲社会结构和思想观念。",
        "expandedDescription": "<h3>死亡的阴影</h3><p>公元1347年，一种烈性传染病——鼠疫，通过商船从克里米亚传入意大利西西里岛，并迅速蔓延至整个欧洲，史称“黑死病”。</p><h3>惨烈的后果</h3><p>黑死病的症状极其恐怖，患者皮肤出现黑斑，高烧不退，往往在感染后几天内死亡。在短短几年内，欧洲人口锐减了三分之一到一半，有些地区甚至死亡了70%以上的人口。劳动力的急剧减少导致了严重的社会和经济危机。</p><h3>深远影响</h3><p>黑死病对欧洲社会产生了深远的影响。它动摇了封建制度的基础，促进了农奴制的瓦解和雇佣劳动的兴起；冲击了天主教会的权威，引发了人们对宗教信仰的质疑；也推动了医学和公共卫生的发展，并在一定程度上促进了文艺复兴的到来。",
        "type": "world"
    },
    {
        "year": "公元1368年",
        "title": "明朝建立",
        "description": "朱元璋推翻元朝，建立明朝，定都应天府（南京），是为明太祖，年号洪武。",
        "expandedDescription": "<h3>草根皇帝</h3><p>朱元璋（1328年-1398年），原名朱重八，出身贫农，少年时因饥荒出家为僧。元末农民起义爆发后，他投身红巾军，逐渐崭露头角，成为一支重要力量的领袖。</p><h3>北伐灭元</h3><p>公元1367年，朱元璋任命徐达为征虏大将军，常遇春为副将军，率军北伐元朝。次年（1368年）正月，朱元璋在应天府（今南京）即皇帝位，建立明朝，是为明太祖，改元洪武。同年秋，明军攻占元大都（今北京），元顺帝北逃，元朝在中原的统治结束。</p><h3>洪武之治</h3><p>明太祖朱元璋在位期间，采取了一系列强化中央集权的措施，如废除宰相制度、设立锦衣卫、大兴文字狱等。同时，他也重视恢复生产，发展经济，史称“洪武之治”。</p>",
        "type": "china"
    },
    {
        "year": "公元1405年",
        "title": "郑和下西洋",
        "description": "明朝宦官郑和率领庞大的船队首次下西洋，访问了东南亚、南亚、西亚和东非的多个国家和地区。",
        "expandedDescription": "<h3>七下西洋</h3><p>公元1405年7月11日（永乐三年六月十五），明朝皇帝朱棣（明成祖）派遣宦官郑和（1371年-1433年）率领一支由200多艘船只、27000多人组成的庞大舰队，从南京龙江港启航，开始了第一次下西洋的航行。</p><h3>和平外交</h3><p>郑和下西洋的主要目的是宣扬国威、发展朝贡贸易、寻找建文帝的下落以及了解海外情况。在28年间（1405年-1433年），郑和共七次下西洋，访问了亚非30多个国家和地区，最远到达了红海沿岸和非洲东海岸。</p><h3>历史意义</h3><p>郑和下西洋是世界航海史上的空前壮举，它加深了中国与亚非各国的友好关系，促进了经济文化交流，展示了明朝前期国力的强盛。然而，由于其主要目的是政治性的，未能持续发展，最终随着明朝国策的转变而终止。",
        "type": "china"
    },
    {
        "year": "公元1453年",
        "title": "君士坦丁堡陷落/百年战争结束",
        "description": "奥斯曼帝国攻陷拜占庭帝国首都君士坦丁堡，拜占庭灭亡；英法百年战争结束。",
        "expandedDescription": "<h3>拜占庭的终结</h3><p>公元1453年5月29日，奥斯曼帝国苏丹穆罕默德二世率领大军攻陷了拜占庭帝国（东罗马帝国）的首都君士坦丁堡，末代皇帝君士坦丁十一世战死。这标志着延续了近一千年的拜占庭帝国（东罗马帝国）的灭亡。</p><h3>历史意义</h3><p>君士坦丁堡的陷落是中世纪结束、近代开始的重要标志之一。它切断了东西方通过地中海的传统贸易路线，促使欧洲人寻找新的通往东方的道路，间接推动了地理大发现。同时，许多拜占庭学者携带古希腊典籍逃往西欧，为文艺复兴提供了重要的知识资源。</p><h3>百年战争落幕</h3><p>同样在1453年，英法百年战争以法国的胜利而结束。法军在圣女贞德精神的鼓舞下，收复了除加来外的全部英国在法国的领地，确立了法国的民族国家地位。",
        "type": "world"
    },
    {
        "year": "公元1492年",
        "title": "哥伦布发现美洲",
        "description": "意大利航海家哥伦布在西班牙王室资助下横渡大西洋，抵达美洲大陆。",
        "expandedDescription": "<h3>向西航行</h3><p>克里斯托弗·哥伦布（1451年-1506年）是一位意大利航海家。他深信地球是圆的，并认为向西航行可以到达东方的印度和中国。他向西班牙王室（伊莎贝拉女王和费迪南德国王）寻求资助。</p><h3>首次航行</h3><p>公元1492年8月3日，哥伦布率领由“圣玛利亚”号、“平塔”号和“尼娜”号三艘船组成的船队，从西班牙巴罗斯港出发，横渡大西洋。经过两个多月的航行，于10月12日到达了巴哈马群岛中的一个小岛（哥伦布命名为圣萨尔瓦多），他以为自己到达了印度，称当地居民为“印第安人”。</p><h3>历史意义</h3><p>哥伦布的首次航行开启了欧洲对美洲的持续接触和探索，标志着地理大发现时代的重大突破。虽然他并非第一个到达美洲的欧洲人（维京人更早），但他的航行及其后续活动对世界历史产生了深远影响，引发了欧洲的殖民扩张和跨大西洋奴隶贸易，也导致了美洲原住民文明的毁灭。",
        "type": "world"
    },
    {
        "year": "公元1517年",
        "title": "宗教改革开始",
        "description": "马丁·路德在维滕贝格教堂门上张贴《九十五条论纲》，反对教皇兜售赎罪券，拉开宗教改革序幕。",
        "expandedDescription": "<h3>赎罪券风波</h3><p>公元16世纪初，罗马天主教会为了筹集资金（部分用于修建圣彼得大教堂），在德意志地区大肆兜售赎罪券，宣称购买赎罪券可以减免罪罚。这种做法引起了广泛的不满。</p><h3>路德的挑战</h3><p>1517年10月31日（一说11月1日），德国神学家、维滕贝格大学教授马丁·路德（1483年-1546年）将他撰写的《关于赎罪券效能的辩论纲要》（即《九十五条论纲》）张贴在维滕贝格城堡教堂的大门上，公开质疑教皇出售赎罪券的权力和神学依据。</p><h3>改革浪潮</h3><p>《九十五条论纲》迅速传播，引发了关于教义、教会权力和宗教实践的广泛讨论。路德进一步提出“因信称义”等核心教义，反对教皇权威，主张《圣经》至上。他的思想点燃了席卷整个欧洲的宗教改革运动，导致了新教的诞生和天主教会的分裂。",
        "type": "world"
    },
    {
        "year": "公元1543年",
        "title": "哥白尼提出日心说",
        "description": "波兰天文学家哥白尼发表《天体运行论》，提出日心说，挑战地心说传统。",
        "expandedDescription": "<h3>颠覆宇宙观</h3><p>尼古拉·哥白尼（1473年-1543年）是文艺复兴时期的波兰天文学家。他经过长期的天文观测和数学计算，对当时占统治地位的托勒密“地心说”宇宙模型产生了怀疑。</p><h3>《天体运行论》</h3><p>公元1543年，哥白尼发表了其毕生研究的结晶——《天体运行论》。在这部著作中，他系统地提出了“日心说”，认为太阳是宇宙的中心，地球和其他行星都围绕太阳运行，地球本身也在自转。</p><h3>科学革命的序曲</h3><p>哥白尼的日心说从根本上改变了人类对宇宙的认识，动摇了中世纪神学宇宙观的基础。虽然他的理论在当时并未被普遍接受，且存在一些缺陷（如仍使用圆形轨道），但它为后来的开普勒、伽利略、牛顿等人的科学研究铺平了道路，被认为是近代科学革命的开端。",
        "type": "world"
    },
    {
        "year": "公元1587年",
        "title": "英国击败西班牙无敌舰队",
        "description": "英国海军在英吉利海峡击败西班牙无敌舰队，阻止了西班牙入侵，确立了英国海上霸权。",
        "expandedDescription": "<h3>无敌舰队的组建</h3><p>公元16世纪，西班牙凭借其在美洲的殖民地和掠夺的金银，成为欧洲最强大的国家。西班牙国王腓力二世为了报复英国支持荷兰独立和海盗劫掠西班牙船只，并企图入侵英国，恢复天主教统治，于1588年组建了一支庞大的舰队，即“无敌舰队”。</p><h3>英西海战</h3><p>1588年7月，西班牙无敌舰队（约130艘战舰）进入英吉利海峡，试图与西班牙陆军会合后入侵英国。英国海军（约100艘战舰）在霍华德、德雷克等人的指挥下，采用灵活机动的战术，利用先进的火炮和更快的船只，对西班牙舰队进行了连续攻击。</p><h3>历史转折点</h3><p>在格拉沃利讷海战后，西班牙舰队被迫向北航行，绕过不列颠群岛返回西班牙，途中遭遇风暴，损失惨重。无敌舰队的覆灭标志着西班牙海上霸权的衰落和英国海上力量的崛起，对欧洲政治格局产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1600年",
        "title": "英国东印度公司成立",
        "description": "英国女王伊丽莎白一世授予特许状，成立英国东印度公司，开启对亚洲的殖民贸易。",
        "expandedDescription": "<h3>殖民公司的先驱</h3><p>公元1600年12月31日，英国女王伊丽莎白一世授予一批伦敦商人特许状，成立了“英国东印度公司”。</p><h3>贸易与扩张</h3><p>东印度公司被授予在好望角以东、麦哲伦海峡以西的广大地区进行贸易的垄断权。它最初主要从事香料贸易，后来逐渐将贸易范围扩展到印度的棉纺织品、茶叶等，并在印度建立了贸易据点和军事基地。</p><h3>从商业到统治</h3><p>随着时间的推移，东印度公司不仅是一个贸易公司，还拥有自己的军队，逐渐介入印度的政治，通过战争和条约不断扩大其控制范围。到18世纪中叶，它实际上已经控制了印度的大部分地区，成为英国在亚洲殖民扩张的核心工具。直到1858年印度民族大起义后，英国政府才正式接管了印度的管理权。",
        "type": "world"
    },
    {
        "year": "公元1607年",
        "title": "北美殖民地建立",
        "description": "英国在北美弗吉尼亚建立詹姆斯敦殖民地，是英国在北美的第一个永久性定居点。",
        "expandedDescription": "<h3>新大陆的定居</h3><p>公元1607年5月14日，由伦敦公司资助的一批英国殖民者在北美弗吉尼亚的詹姆斯河畔建立了詹姆斯敦，这是英国在北美的第一个永久性殖民地。</p><h3>艰难的开端</h3><p>詹姆斯敦的早期历史充满了艰辛。殖民者面临着食物短缺、疾病肆虐、与当地印第安人关系紧张等问题，殖民地一度濒临毁灭。约翰·史密斯船长等人的努力和烟草种植的成功帮助殖民地度过了难关。</p><h3>殖民扩张的起点</h3><p>詹姆斯敦的建立标志着英国在北美系统性殖民扩张的开始。此后，英国陆续在北美东海岸建立了更多的殖民地，为后来美国的建立奠定了基础。",
        "type": "world"
    },
    {
        "year": "公元1618年",
        "title": "三十年战争开始",
        "description": "神圣罗马帝国内部的新教诸侯与天主教诸侯因宗教和政治矛盾爆发战争，后演变为全欧洲的大战。",
        "expandedDescription": "<h3>宗教与政治的冲突</h3><p>公元1618年，神圣罗马帝国内部的宗教和政治矛盾激化。波希米亚（今捷克）的新教贵族因反对皇帝斐迪南二世（天主教徒）限制新教信仰的政策，在布拉格发动起义，将皇帝的两名代表从窗户扔出（“掷出窗外事件”），标志着三十年战争（1618年-1648年）的开始。</p><h3>欧洲大战</h3><p>战争最初是神圣罗马帝国内部的宗教冲突，但很快演变为一场席卷整个欧洲的国际战争。丹麦、瑞典、法国、西班牙、奥地利等国都卷入其中，形成了复杂的政治和军事联盟。</p><h3>威斯特伐利亚和约</h3><p>战争持续了三十年，给欧洲带来了巨大的破坏。最终于1648年签订了《威斯特伐利亚和约》，确立了国家主权原则和宗教宽容原则，对近代国际关系体系的形成产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1640年",
        "title": "英国资产阶级革命开始",
        "description": "英国国王查理一世为筹集军费召开议会，但遭到议会抵制，英国资产阶级革命爆发。",
        "expandedDescription": "<h3>王权与议会的冲突</h3><p>公元1640年，英国国王查理一世为了筹集对苏格兰主教战争的军费，被迫重新召开已解散11年的议会（史称“长期议会”）。然而，议员们不仅拒绝拨款，还提出了限制王权、改革政治的要求。</p><h3>革命的导火索</h3><p>查理一世与议会展开了长期的斗争，最终导致了英国内战（1642年-1651年）的爆发。议会军在克伦威尔的领导下击败了王党军，查理一世于1649年被处死，英国宣布成立共和国。</p><h3>历史意义</h3><p>英国资产阶级革命是世界历史上第一次成功的资产阶级革命，它推翻了封建君主专制，确立了资产阶级的统治地位，为英国资本主义的发展扫清了道路，并对后来的欧美资产阶级革命产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1644年",
        "title": "清朝建立",
        "description": "李自成攻入北京，明朝灭亡。清军在吴三桂引导下入关，击败李自成，定都北京，建立清朝。",
        "expandedDescription": "<h3>明清交替</h3><p>公元1644年是中国历史上一个重要的转折点。这一年，李自成领导的大顺农民军攻入北京，崇祯皇帝朱由检在煤山（今景山）自缢，明朝灭亡。</p><h3>清军入关</h3><p>驻守山海关的明将吴三桂，在李自成攻占北京后，因个人恩怨（一说为夺回爱妾陈圆圆）引清军入关。清摄政王多尔衮率领八旗军与吴三桂合兵，在一片石之战中击败了李自成的大顺军。李自成退回北京称帝后匆忙撤离，清军随即占领北京。</p><h3>清朝定鼎</h3><p>清军入关后，逐步消灭了李自成、张献忠等农民军以及南明残余势力，统一了全国。公元1644年，顺治帝福临迁都北京，清朝（1644年-1912年）正式建立，成为中国历史上最后一个封建王朝。",
        "type": "china"
    },
    {
        "year": "公元1683年",
        "title": "维也纳之战",
        "description": "神圣罗马帝国联军在维也纳击败奥斯曼帝国军队，阻止了奥斯曼帝国向中欧的扩张。",
        "expandedDescription": "<h3>奥斯曼的威胁</h3><p>公元17世纪，奥斯曼帝国是欧洲最强大的国家之一，其势力范围不断向欧洲扩张。维也纳作为神圣罗马帝国的重要城市和欧洲的十字路口，长期以来受到奥斯曼帝国的威胁。</p><h3>围城与解围</h3><p>公元1683年7月，奥斯曼帝国大维齐尔卡拉·穆斯塔法率领约15万大军围攻维也纳。维也纳守军在洛林公爵查理五世的指挥下坚守了两个月。9月12日，由波兰国王扬三世索别斯基率领的神圣罗马帝国、波兰、德意志等国联军（约8万人）赶到，在维也纳城外的卡伦贝格山向奥斯曼军队发起总攻。</p><h3>欧洲的胜利</h3><p>联军（尤其是波兰翼骑兵）的冲锋击溃了奥斯曼军队，解除了维也纳之围。这场胜利不仅挽救了维也纳和神圣罗马帝国，也标志着奥斯曼帝国向中欧扩张的势头被彻底遏制，并从此开始走向衰落。它被视为欧洲基督教文明抵御伊斯兰扩张的一个重要转折点。",
        "type": "world"
    },
    {
        "year": "公元1687年",
        "title": "牛顿发表《自然哲学的数学原理》",
        "description": "艾萨克·牛顿发表《自然哲学的数学原理》，提出了万有引力定律和三大运动定律，奠定经典力学基础。",
        "expandedDescription": "<h3>科学的革命</h3><p>公元1687年7月5日，英国物理学家、数学家艾萨克·牛顿（1643年-1727年）发表了其最重要的科学著作《自然哲学的数学原理》（简称《原理》）。</p><h3>三大定律</h3><p>在这部划时代的著作中，牛顿系统地阐述了他的三大运动定律和万有引力定律。三大运动定律描述了物体运动的基本规律：惯性定律、加速度定律和作用力与反作用力定律。万有引力定律则揭示了任何两个有质量的物体之间都存在相互吸引的力。</p><h3>深远影响</h3><p>《自然哲学的数学原理》的发表标志着经典力学体系的建立，是科学史上的一座丰碑。它不仅统一了地球上的力学和天体力学，解释了潮汐、彗星轨道等自然现象，也为后来的工程技术发展奠定了理论基础。牛顿的理论统治了物理学界两百多年，直到爱因斯坦相对论的出现。",
        "type": "world"
    },
    {
        "year": "公元1776年",
        "title": "美国独立宣言发表",
        "description": "北美十三个殖民地代表在费城发表《独立宣言》，宣布脱离英国独立，美利坚合众国成立。",
        "expandedDescription": "<h3>殖民地的不满</h3><p>18世纪中后期，英国为了弥补七年战争的财政亏空，开始对北美殖民地征收各种赋税（如《印花税法》、《茶叶法》），引发了殖民地人民的强烈不满和反抗，口号是“无代表，不纳税”。</p><h3>独立的呼声</h3><p>1774年，各殖民地代表召开第一届大陆会议，商讨对策。1775年，列克星敦和康科德的枪声标志着美国独立战争的爆发。1776年7月4日，第二届大陆会议在费城批准了由托马斯·杰斐逊为主要起草人撰写的《独立宣言》。</p><h3>自由的宣言</h3><p>《独立宣言》阐述了天赋人权、自由平等、人民主权等启蒙思想，列举了英王的种种罪行，庄严宣告北美十三个殖民地脱离英国而独立，成立美利坚合众国。7月4日后来成为美国的独立日。《独立宣言》是美国建国的重要文献，也对世界范围内的民族独立运动产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1789年",
        "title": "法国大革命爆发",
        "description": "法国巴黎人民攻占巴士底狱，法国大革命开始，推翻了波旁王朝的封建统治。",
        "expandedDescription": "<h3>旧制度的危机</h3><p>18世纪末，法国社会矛盾尖锐。封建专制统治腐朽，财政濒临破产；社会分为三个等级，第一等级（教士）和第二等级（贵族）享有特权，第三等级（资产阶级、城市平民、农民）承担沉重赋税却无政治权利；启蒙思想广泛传播，自由、平等、博爱理念深入人心。</p><h3>三级会议与革命爆发</h3><p>为解决财政危机，路易十六被迫于1789年5月召开已中断175年的三级会议。第三等级代表要求增加自身权力，与国王和前两个等级产生激烈冲突。6月，他们自行组成“国民议会”，宣誓不制定出新宪法绝不解散（网球场宣言）。</p><h3>攻占巴士底狱</h3><p>7月14日，巴黎人民起义，攻占了象征王权专制的巴士底狱，释放了囚犯，夺取了武器。这一事件标志着法国大革命的正式爆发。随后，革命迅速发展，颁布了《人权宣言》，废除了封建制度。",
        "type": "world"
    },
    {
        "year": "公元1804年",
        "title": "拿破仑称帝",
        "description": "拿破仑·波拿巴加冕称帝，建立法兰西第一帝国。",
        "expandedDescription": "<h3>共和国的终结</h3><p>法国大革命后，法兰西第一共和国成立。拿破仑·波拿巴（1769年-1821年）在平息国内保王党叛乱和对外战争中屡建奇功，成为法国政坛的风云人物。1799年，他发动“雾月政变”，推翻督政府，自任第一执政，集大权于一身。</p><h3>加冕称帝</h3><p>公元1804年5月18日，拿破仑通过公民投票被宣布为“法国人的皇帝”。同年12月2日，他在巴黎圣母院由教皇庇护七世主持加冕典礼，自己将皇冠戴到头上（而非由教皇加冕），然后又为皇后约瑟芬加冕。</p><h3>帝国的建立</h3><p>拿破仑称帝，标志着法兰西第一共和国的结束和法兰西第一帝国的建立。他颁布了《拿破仑法典》，巩固了资产阶级革命的成果，并继续进行对外战争，极大地扩展了法国的势力范围，但也最终导致了他的失败。",
        "type": "world"
    },
    {
        "year": "公元1815年",
        "title": "拿破仑战争结束/滑铁卢战役",
        "description": "拿破仑在滑铁卢战役中被反法联军击败，被流放圣赫勒拿岛，拿破仑战争结束。",
        "expandedDescription": "<h3>百日王朝</h3><p>公元1814年，拿破仑兵败，被迫退位并被流放厄尔巴岛。路易十八复辟波旁王朝。然而，拿破仑于1815年3月秘密逃离厄尔巴岛，在法国南部登陆，一路北上，沿途士兵和民众纷纷倒戈支持他，未发一枪就重返巴黎，开始了“百日王朝”。</p><h3>滑铁卢决战</h3><p>1815年6月18日，拿破仑率领法军在比利时的滑铁卢与由威灵顿公爵率领的英荷联军和布吕歇尔率领的普鲁士军队展开决战。经过激烈战斗，法军最终被击败，拿破仑仓皇逃离战场。</p><h3>战争的终结</h3><p>滑铁卢战役的失败彻底终结了拿破仑的政治和军事生涯。他再次退位，被英国人流放到遥远的南大西洋圣赫勒拿岛，并在那里度过了余生。拿破仑战争（1803年-1815年）至此结束，欧洲进入了维也纳会议确立的“神圣同盟”体系时期。",
        "type": "world"
    },
    {
        "year": "公元1840年",
        "title": "鸦片战争",
        "description": "英国为打开中国市场发动鸦片战争，清政府战败，签订《南京条约》，中国开始沦为半殖民地半封建社会。",
        "expandedDescription": "<h3>贸易冲突</h3><p>公元1840年6月，英国政府以林则徐虎门销烟为借口，发动了对中国的侵略战争，史称“鸦片战争”。</p><h3>不平等条约</h3><p>战争以清政府的失败告终。1842年8月29日，清政府被迫与英国签订了中国近代史上第一个不平等条约——《南京条约》。条约规定割让香港岛给英国，开放广州、厦门、福州、宁波、上海五处为通商口岸，赔款2100万银元，协定关税等。</p><h3>历史转折点</h3><p>鸦片战争是中国近代史的开端。它打破了中国长期闭关锁国的状态，西方列强凭借坚船利炮打开了中国的大门。战后签订的一系列不平等条约，使中国丧失了大量主权和领土，逐步沦为半殖民地半封建社会。",
        "type": "china"
    },
    {
        "year": "公元1848年",
        "title": "《共产党宣言》发表",
        "description": "马克思和恩格斯为共产主义者同盟起草的《共产党宣言》在伦敦发表，标志着马克思主义的诞生。",
        "expandedDescription": "<h3>无产阶级的理论武器</h3><p>公元1848年2月，卡尔·马克思和弗里德里希·恩格斯为共产主义者同盟起草的纲领性文件《共产党宣言》在英国伦敦首次以单行本形式发表。</p><h3>核心思想</h3><p>《共产党宣言》系统阐述了马克思主义的基本原理，包括：历史唯物主义关于社会发展的基本规律；阶级斗争是阶级社会发展的动力；资本主义必然灭亡、社会主义必然胜利的“两个必然”；无产阶级的历史使命和共产党的性质、特点、基本纲领等。</p><h3>深远影响</h3><p>《共产党宣言》的发表标志着马克思主义的诞生，为国际共产主义运动提供了科学的理论指导。它深刻地影响了此后世界历史的进程，成为无产阶级和被压迫人民争取解放的强大思想武器。",
        "type": "world"
    },
    {
        "year": "公元1851年",
        "title": "太平天国运动",
        "description": "洪秀全在广西金田发动起义，建立太平天国，是近代中国规模最大的农民起义。",
        "expandedDescription": "<h3>宗教与起义</h3><p>公元1851年1月11日，洪秀全（1814年-1864年）在广西桂平县金田村发动武装起义，建号“太平天国”，自称“天王”，标志着太平天国运动的正式开始。</p><h3>运动发展</h3><p>太平军从广西出发，转战湖南、湖北、江西、安徽，于1853年3月攻占南京，定为都城，改名“天京”。太平天国颁布了《天朝田亩制度》，提出了建立“有田同耕，有饭同食，有衣同穿，有钱同使”的理想社会的方案。</p><h3>历史意义</h3><p>太平天国运动是中国近代史上规模最大的一次农民起义，它沉重打击了清朝的腐朽统治，也对外国侵略势力进行了英勇的抵抗。虽然最终在中外反动势力的联合绞杀下失败，但它对晚清政治格局和社会思想产生了深远影响。",
        "type": "china"
    },
    {
        "year": "公元1861年",
        "title": "美国南北战争/俄国农奴制改革",
        "description": "美国南方诸州发动叛乱，南北战争爆发；俄国沙皇亚历山大二世签署废除农奴制法令。",
        "expandedDescription": "<h3>美国：国家统一的考验</h3><p>公元1861年4月12日，美国南方联盟军队炮击联邦军队驻守的萨姆特要塞，南北战争（美国内战）正式爆发。战争的根源在于南北方在奴隶制问题上的尖锐矛盾。</p><h3>战争进程与结果</h3><p>战争初期，北方在军事上屡遭失利。1863年，林肯总统颁布《解放奴隶宣言》，将战争目标转变为维护联邦统一和解放奴隶。最终，北方在格兰特等将领的指挥下取得胜利，南方投降，美国重新统一。南北战争废除了奴隶制，为美国资本主义的进一步发展扫清了障碍。</p><h3>俄国：自上而下的改革</h3><p>公元1861年3月3日（俄历2月19日），沙皇亚历山大二世签署法令，宣布废除农奴制。这项改革虽然保留了大量的封建残余，但它使农奴获得了人身自由，为俄国资本主义的发展提供了自由劳动力，是俄国历史上重要的转折点。",
        "type": "world"
    },
    {
        "year": "公元1868年",
        "title": "明治维新开始",
        "description": "日本倒幕派推翻德川幕府统治，明治天皇即位，开始推行一系列资产阶级性质的改革。",
        "expandedDescription": "<h3>幕府的危机</h3><p>19世纪中期，日本处于德川幕府统治下的封建社会。闭关锁国政策使日本与世隔绝，但西方列强的坚船利炮（如1853年佩里叩关）打破了日本的锁国状态，使其面临沦为半殖民地的危机。幕府的妥协政策加剧了国内矛盾，倒幕运动兴起。</p><h3>王政复古</h3><p>公元1867年，倒幕派（以萨摩、长州等西南强藩为主）在京都发动“王政复古”政变，迫使幕府将军德川庆喜“奉还大政”。1868年，倒幕派军队在鸟羽、伏见之战中击败幕府军，德川幕府的统治被推翻。</p><h3>维新改革</h3><p>明治政府随即开始了一系列全面而深刻的改革，史称“明治维新”。其主要内容包括：“废藩置县”，加强中央集权；“殖产兴业”，发展资本主义工商业；“文明开化”，学习西方文化和生活方式；“富国强兵”，建立现代化的军队。</p><h3>脱亚入欧</h3><p>明治维新使日本在短短几十年内摆脱了沦为殖民地的危机，迅速走上了资本主义发展道路，并成为亚洲第一个近代化国家，跻身世界强国之列。然而，其改革的不彻底性也为后来的军国主义埋下了伏笔。",
        "type": "world"
    },
    {
        "year": "公元1871年",
        "title": "德意志帝国建立",
        "description": "普鲁士国王威廉一世在凡尔赛宫加冕为德意志皇帝，德意志帝国宣告成立，结束了德意志长期分裂的局面。",
        "expandedDescription": "<h3>铁血统一</h3><p>公元1871年1月18日，普鲁士国王威廉一世在法国凡尔赛宫的镜厅加冕为“德意志皇帝”，宣告德意志帝国正式成立。</p><h3>三次王朝战争</h3><p>德意志的统一是在普鲁士首相奥托·冯·俾斯麦的领导下，通过三次王朝战争（普丹战争、普奥战争、普法战争）击败丹麦、奥地利和法国而实现的。俾斯麦因此被称为“铁血宰相”。</p><h3>历史意义</h3><p>德意志帝国的建立结束了德意志地区长达数百年的政治分裂，为德国资本主义的迅速发展奠定了基础。统一后的德国迅速崛起为欧洲强国，其强大的工业和军事实力对欧洲乃至世界的格局产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1889年",
        "title": "第二次工业革命高潮",
        "description": "电力、内燃机、化学工业等新技术广泛应用，推动了生产力的巨大飞跃，资本主义进入垄断阶段。",
        "expandedDescription": "<h3>科技的飞跃</h3><p>第二次工业革命（约1870年-1914年）是以电力、内燃机、化学工业和钢铁工业的突破性发展为标志的。它紧接第一次工业革命之后，在欧美发达国家率先兴起。</p><h3>新兴产业</h3><p>电力成为新的能源，推动了电灯、电话、电报、电动机等的发明和应用；内燃机的发明促进了汽车、飞机等新式交通工具的诞生；化学工业的发展产生了染料、化肥、炸药等新产品；炼钢技术的进步（如贝塞麦转炉炼钢法）为大规模基础设施建设提供了材料。</p><h3>垄断资本主义</h3><p>第二次工业革命进一步推动了生产力的发展，也加剧了生产和资本的集中，导致了垄断组织的产生，资本主义开始向垄断阶段（帝国主义阶段）过渡。这为20世纪的世界格局和冲突埋下了伏笔。",
        "type": "world"
    },
    {
        "year": "公元1900年",
        "title": "义和团运动",
        "description": "义和团在山东、直隶兴起，提出“扶清灭洋”口号，反对外国侵略，后被八国联军镇压。",
        "expandedDescription": "<h3>反帝爱国运动</h3><p>公元1900年，义和团运动在中国北方（主要是山东、直隶）蓬勃发展。义和团（又称“义和拳”）成员多为农民和手工业者，他们练习拳棒、传授武艺，打着“扶清灭洋”的旗号，反对帝国主义侵略。</p><h3>八国联军侵华</h3><p>义和团运动的发展引起了帝国主义列强的恐慌。1900年6月，英、美、德、法、俄、日、意、奥八国组成联军，在英国海军中将西摩尔的率领下，从天津向北京进犯，发动了侵华战争。</p><h3>辛丑条约</h3><p>在中外反动势力的联合镇压下，义和团运动最终失败。1901年9月7日，清政府被迫与十一国签订了丧权辱国的《辛丑条约》。巨额赔款、允许外国驻军、划定使馆界等条款，使中国完全沦为半殖民地半封建社会。",
        "type": "china"
    },
    {
        "year": "公元1905年",
        "title": "爱因斯坦提出相对论",
        "description": "阿尔伯特·爱因斯坦发表狭义相对论，提出了著名的质能方程E=mc²，引发了物理学革命。",
        "expandedDescription": "<h3>物理学的革命</h3><p>公元1905年，年仅26岁的德国物理学家阿尔伯特·爱因斯坦（1879年-1955年）发表了多篇具有划时代意义的论文，其中关于狭义相对论的论文《论动体的电动力学》彻底改变了人们对时间、空间和物质运动的认识。</p><h3>核心原理</h3><p>狭义相对论基于两个基本假设：相对性原理（所有惯性系中的物理定律都相同）和光速不变原理（真空中光速对所有观察者都是恒定的）。由此推导出时间和空间的相对性、同时性的相对性、长度收缩、时间延缓、质能关系等一系列革命性结论。</p><h3>深远影响</h3><p>爱因斯坦的相对论是现代物理学的两大支柱之一（另一为量子力学），它不仅解决了经典物理学的一些疑难问题，也为原子能技术、激光技术、全球定位系统等现代科技的发展奠定了理论基础，并深刻地影响了人类的宇宙观。",
        "type": "world"
    },
    {
        "year": "公元1911年",
        "title": "辛亥革命",
        "description": "武昌起义爆发，各省纷纷响应，推翻了清朝统治，结束了中国两千多年的封建帝制。",
        "expandedDescription": "<h3>武昌首义</h3><p>公元1911年10月10日（农历辛亥年八月十九日），湖北新军中的革命党人在武昌发动起义，迅速占领武昌、汉口、汉阳三镇，史称“武昌起义”或“辛亥首义”。</p><h3>全国响应</h3><p>武昌起义的成功极大地鼓舞了全国各地的革命力量。在一个月内，湖南、陕西、江西、山西、云南、浙江、贵州、江苏、安徽、广西、福建、广东等省纷纷宣布独立，脱离清政府。</p><h3>帝制终结</h3><p>在革命形势的压力下，清政府被迫起用袁世凯镇压革命。经过南北议和，1912年2月12日，宣统帝溥仪宣布退位，清朝统治结束。1912年1月1日，孙中山在南京就任中华民国临时大总统，宣告中华民国成立。辛亥革命推翻了统治中国两千多年的封建君主专制制度，开创了完全意义上的近代民族民主革命。",
        "type": "china"
    },
    {
        "year": "公元1912年",
        "title": "中华民国成立",
        "description": "孙中山在南京就任临时大总统，宣告中华民国成立，结束了中国两千多年的帝制。",
        "expandedDescription": "<h3>走向共和</h3><p>辛亥革命爆发后，各省纷纷宣布独立，推翻清朝统治。1912年1月1日，孙中山（1866年-1925年）在南京宣誓就任中华民国临时大总统，宣告中华民国正式成立。新的共和政府颁布了《中华民国临时约法》，确立了三权分立的共和体制。</p><p>中华民国的成立是中国近代史上的里程碑，它结束了中国两千多年的封建君主专制制度，建立了亚洲第一个共和国，使民主共和的观念深入人心。尽管此后中国仍面临军阀混战、外敌入侵等诸多挑战，但共和的种子已然播下。</p>",
        "type": "china"
    },
    {
        "year": "公元1914年",
        "title": "第一次世界大战爆发",
        "description": "奥匈帝国皇储斐迪南大公在萨拉热窝遇刺，引发欧洲列强间的全面战争。",
        "expandedDescription": "<h3>萨拉热窝事件</h3><p>公元1914年6月28日，奥匈帝国皇储弗朗茨·斐迪南大公在波斯尼亚首府萨拉热窝进行军事访问时，被塞尔维亚青年加夫里洛·普林西普刺杀。这一事件成为第一次世界大战的直接导火索。</p><h3>战争的爆发</h3><p>奥匈帝国以此为借口向塞尔维亚宣战。由于欧洲列强之间复杂的同盟关系（三国同盟对比三国协约），战争迅速蔓延。俄国支持塞尔维亚，德国支持奥匈帝国，法国和英国随后也卷入战争。1914年8月，欧洲主要强国均已参战，第一次世界大战全面爆发。</p><h3>全球性冲突</h3><p>第一次世界大战（1914年-1918年）是一场帝国主义性质的战争，主要在欧洲进行，但也波及到亚洲、非洲和太平洋地区。战争造成了巨大的人员伤亡和财产损失，深刻改变了世界格局。",
        "type": "world"
    },
    {
        "year": "公元1917年",
        "title": "俄国十月革命",
        "description": "俄国布尔什维克党在彼得格勒发动武装起义，推翻资产阶级临时政府，建立苏维埃政权。",
        "expandedDescription": "<h3>革命的胜利</h3><p>公元1917年11月7日（俄历10月25日），在弗拉基米尔·列宁和列夫·托洛茨基等人的领导下，俄国布尔什维克党在彼得格勒（今圣彼得堡）发动武装起义，占领了冬宫，推翻了资产阶级临时政府。</p><h3>苏维埃政权</h3><p>起义胜利后，全俄工兵代表苏维埃第二次代表大会召开，通过了列宁起草的《和平法令》和《土地法令》，宣布成立世界上第一个社会主义国家——俄罗斯苏维埃联邦社会主义共和国（简称苏俄）。</p><h3>历史意义</h3><p>俄国十月革命是人类历史上第一次成功的无产阶级社会主义革命，它建立了世界上第一个无产阶级专政的国家，打破了资本主义一统天下的局面，开辟了人类历史的新纪元。它也激励了世界各国无产阶级和被压迫民族的解放斗争。",
        "type": "world"
    },
    {
        "year": "公元1919年",
        "title": "五四运动",
        "description": "中国在巴黎和会上外交失败，北京学生发起示威游行，要求“外争主权，内除国贼”，五四运动爆发。",
        "expandedDescription": "<h3>爱国的怒吼</h3><p>公元1919年5月4日，因中国在巴黎和会上外交失败，将德国在山东的权益转让给日本，北京的三千多名学生在天安门集会示威，打出“外争主权，内惩国贼”、“废除二十一条”、“拒绝在和约上签字”等口号，要求惩办亲日派官僚，拒绝在《凡尔赛和约》上签字。</p><h3>全民参与</h3><p>五四运动迅速扩展到上海、天津、武汉、广州等地，工人罢工、商人罢市、学生罢课，形成了全国规模的群众性反帝爱国运动。</p><h3>新民主主义革命的开端</h3><p>五四运动是一次彻底地反对帝国主义和封建主义的爱国运动。它标志着中国工人阶级开始登上政治舞台，展现了伟大的力量。一些初步接受了马克思主义的知识分子和青年学生，在运动中起了重要作用。五四运动是中国新民主主义革命的开端，为中国共产党的成立做了思想上和干部上的准备。",
        "type": "china"
    },
    {
        "year": "公元1921年",
        "title": "中国共产党成立",
        "description": "中国共产党第一次全国代表大会在上海召开，宣告中国共产党正式成立，中国革命面貌焕然一新。",
        "expandedDescription": "<h3>开天辟地的大事变</h3><p>公元1921年7月23日，中国共产党第一次全国代表大会在上海法租界望志路106号（今兴业路76号）召开。最后一天的会议转移到浙江嘉兴南湖的一艘游船上举行。</p><h3>一大代表</h3><p>参加会议的有来自各地共产党早期组织的代表毛泽东、何叔衡、董必武、陈潭秋、王尽美、邓恩铭、李达、李汉俊、张国焘、刘仁静、陈公博、周佛海，以及陈独秀指定的代表包惠僧，共产国际代表马林和尼科尔斯基也出席了会议。</p><h3>纲领与目标</h3><p>大会通过了中国共产党的第一个纲领和第一个决议，确定党的名称为“中国共产党”，明确党的纲领是推翻资产阶级政权，建立无产阶级专政，实现共产主义。大会选举产生了党的领导机构——中央局，陈独秀为书记。</p><h3>历史意义</h3><p>中国共产党的成立，是近代中国社会进步和革命发展的客观要求，是开天辟地的大事变。自从有了中国共产党，中国革命的面貌就焕然一新了。</p>",
        "type": "china"
    },
    {
        "year": "公元1929年",
        "title": "经济大危机",
        "description": "美国股市崩盘引发资本主义世界空前严重的经济危机，导致大量企业破产、工人失业、农业萧条。",
        "expandedDescription": "<h3>黑色星期四</h3><p>公元1929年10月24日（星期四），美国纽约股票市场出现恐慌性抛售，股价暴跌，史称“黑色星期四”。10月29日（星期二）再次出现更严重的股市崩盘，史称“黑色星期二”。</p><h3>危机蔓延</h3><p>这场起源于美国的股市危机迅速蔓延至整个资本主义世界，演变成一场空前严重的经济大危机。工业生产急剧下降，企业大量倒闭，银行纷纷破产，工人失业率飙升，农产品价格暴跌，国际贸易严重萎缩。</p><h3>深远影响</h3><p>1929年-1933年的经济大危机持续时间长、波及范围广、破坏力强，给资本主义世界带来了沉重打击。它加剧了各国内部的社会矛盾，也激化了帝国主义国家之间的矛盾，为法西斯主义的上台和第二次世界大战的爆发埋下了伏笔。",
        "type": "world"
    },
    {
        "year": "公元1933年",
        "title": "罗斯福新政",
        "description": "富兰克林·罗斯福就任美国总统，推行“新政”，通过国家干预经济来应对经济大危机。",
        "expandedDescription": "<h3>新政的实施</h3><p>公元1933年3月4日，富兰克林·德拉诺·罗斯福就任美国第32任总统。面对严重的经济危机，他上台后立即推行了一系列被称为“新政”的改革措施。</p><h3>主要内容</h3><p>罗斯福新政的主要内容可以用“三R”来概括：救济、复兴和改革。具体措施包括：整顿银行金融业、放弃金本位制；颁布《全国工业复兴法》，调整工业生产；颁布《农业调整法》，稳定农产品价格；兴办公共工程，实行“以工代赈”；建立社会保障制度等。</p><h3>历史意义</h3><p>罗斯福新政通过国家对经济的全面干预，在一定程度上缓解了经济危机，稳定了社会秩序，巩固了资本主义制度。它开创了国家垄断资本主义的新模式，对战后西方国家的经济发展产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1937年",
        "title": "全面抗日战争爆发",
        "description": "日本发动卢沟桥事变，中国军队奋起抵抗，全国性抗日战争爆发。",
        "expandedDescription": "<h3>卢沟桥事变</h3><p>公元1937年7月7日夜，日本驻丰台的军队在北平西南的卢沟桥附近进行军事演习，借口一名士兵失踪，要求进入宛平县城搜查，遭到中国守军拒绝。日军随即向中国军队发起攻击，中国守军奋起抵抗，这就是“七七事变”或“卢沟桥事变”。</p><h3>全面抗战</h3><p>卢沟桥事变标志着日本帝国主义全面侵华战争的开始，也标志着中国全国性抗日战争的爆发。事变后，国共两党实现了第二次合作，建立了抗日民族统一战线，共同抗击日本侵略者。</p><h3>持久的斗争</h3><p>中国人民的抗日战争是世界反法西斯战争的重要组成部分，也是中国近代以来第一次取得完全胜利的民族解放战争。经过八年的艰苦卓绝的斗争，中国人民最终打败了日本侵略者，为世界反法西斯战争的胜利做出了巨大贡献。",
        "type": "china"
    },
    {
        "year": "公元1939年",
        "title": "第二次世界大战爆发",
        "description": "德国闪击波兰，英法对德宣战，第二次世界大战全面爆发。",
        "expandedDescription": "<h3>闪电战的威力</h3><p>公元1939年9月1日凌晨，德国集中大量飞机、坦克和机械化部队，对波兰发动了突然袭击，实施了“闪电战”战术。波兰军队难以抵挡，迅速溃败。</p><h3>战争的全面爆发</h3><p>德国的侵略行为激起了英法等国的愤怒。1939年9月3日，英国和法国对德国宣战，第二次世界大战在欧洲全面爆发。随后，苏联根据《苏德互不侵犯条约》的秘密协定，也于9月17日入侵波兰东部。</p><h3>全球性的冲突</h3><p>第二次世界大战（1939年-1945年）是一场世界人民反法西斯战争。战争范围遍及欧洲、亚洲、非洲和大洋洲。轴心国集团（德、意、日）与同盟国集团（中、美、英、苏等）展开了殊死搏斗，最终以法西斯轴心国的彻底失败而告终。",
        "type": "world"
    },
    {
        "year": "公元1945年",
        "title": "第二次世界大战结束",
        "description": "德国、日本相继投降，第二次世界大战结束。",
        "expandedDescription": "<h3>欧洲战场的结束</h3><p>公元1945年上半年，苏军在东线发起强大攻势，美英盟军在西线配合，德国法西斯节节败退。1945年4月，苏军攻入柏林。5月8日，德国签署无条件投降书，欧洲战场的战争结束。</p><h3>太平洋战场的终结</h3><p>在亚洲和太平洋战场，美军逐步逼近日本本土。1945年8月6日和9日，美国在日本广岛和长崎投下原子弹。同时，苏联对日宣战，出兵中国东北。在巨大的军事压力下，日本天皇于8月15日宣布无条件投降。9月2日，日本正式签署投降书，第二次世界大战结束。</p><h3>历史意义</h3><p>第二次世界大战是人类历史上规模最大的战争，给人类带来了空前的灾难。战争的胜利彻底粉碎了法西斯主义，促进了民族解放运动，推动了科学技术的发展，并为联合国等国际组织的建立奠定了基础，对世界历史进程产生了深远影响。",
        "type": "world"
    },
    {
        "year": "公元1949年",
        "title": "中华人民共和国成立",
        "description": "毛泽东主席在天安门城楼宣告中华人民共和国中央人民政府成立，中国历史进入新纪元。",
        "expandedDescription": "<h3>新民主主义革命的胜利</h3><p>公元1949年10月1日，经过长达28年（1921-1949）艰苦卓绝的斗争，中国共产党领导中国人民取得了新民主主义革命的胜利，推翻了帝国主义、封建主义和官僚资本主义的统治。</p><h3>开国大典</h3><p>1949年10月1日下午3时，毛泽东主席在天安门城楼上向全世界庄严宣告：“中华人民共和国中央人民政府今天成立了！”（即“开国大典”）。随后举行了盛大的阅兵式和群众游行。</p><h3>历史意义</h3><p>中华人民共和国的成立，标志着中国新民主主义革命的基本胜利，结束了中国半殖民地半封建社会的历史，实现了民族独立、人民解放和国家统一。中国历史从此进入一个人民当家作主的新时代，中华民族的发展从此开启了新的历史纪元。",
        "type": "china"
    },
    {
        "year": "公元1969年",
        "title": "人类首次登月",
        "description": "美国“阿波罗11号”宇宙飞船成功登陆月球，宇航员阿姆斯特朗和奥尔德林成为首次踏上月球的人类。",
        "expandedDescription": "<h3>一大步</h3><p>公元1969年7月20日，美国国家航空航天局的“阿波罗11号”宇宙飞船成功在月球表面着陆。宇航员尼尔·阿姆斯特朗和巴兹·奥尔德林成为首次踏上月球的人类。</p><h3>历史时刻</h3><p>阿姆斯特朗踏上月球时说出了那句著名的话：“这是我个人的一小步，却是人类的一大步。”他们也在月球表面进行了约两个半小时的活动，收集了月球岩石和土壤样本。</p><h3>太空竞赛</h3><p>阿波罗11号的成功是美苏冷战期间太空竞赛的高潮。它实现了美国总统肯尼迪在1961年提出的“在十年内将人类送上月球并安全返回”的目标，标志着美国在太空竞赛中的胜利，也是人类探索宇宙征程中的一个里程碑。",
        "type": "world"
    },
    {
        "year": "公元1971年",
        "title": "中国恢复联合国合法席位",
        "description": "第26届联合国大会通过决议，恢复中华人民共和国在联合国的一切合法权利。",
        "expandedDescription": "<h3>外交的重大胜利</h3><p>公元1971年10月25日，第26届联合国大会以压倒性多数通过了阿尔巴尼亚、阿尔及利亚等23国提出的决议，决定恢复中华人民共和国在联合国组织中的合法权利，同时立即把蒋介石集团的代表从联合国及其所属一切机构中驱逐出去。</p><h3>历史意义</h3><p>这是中国外交战线上的一个重大胜利，标志着新中国在国际舞台上地位的显著提高。从此，中国作为联合国安理会常任理事国之一，在国际事务中发挥着越来越重要的作用。这一事件也反映了当时国际政治格局的变化。",
        "type": "china"
    },
    {
        "year": "公元1972年",
        "title": "尼克松访华",
        "description": "美国总统尼克松访问中国，中美双方在上海发表《联合公报》，标志着中美关系开始走向正常化。",
        "expandedDescription": "<h3>跨越太平洋的握手</h3><p>公元1972年2月21日至28日，美国总统理查德·尼克松对中国进行了历史性的访问。这是自1949年中华人民共和国成立以来，美国总统首次访问中国。</p><h3>《上海公报》</h3><p>访问期间，尼克松与毛泽东主席、周恩来总理举行了会谈。2月28日，中美双方在上海发表了《联合公报》。公报确认了“一个中国”的原则，并在台湾问题上达成谅解，标志着中美两国结束了长期的敌对状态，开始走向关系正常化。</p><h3>国际格局</h3><p>尼克松访华是20世纪外交史上的重大事件。它打破了冷战时期的外交僵局，对国际战略格局产生了深远影响，也为后来的中美建交（1979年）奠定了基础。",
        "type": "world"
    },
    {
        "year": "公元1978年",
        "title": "中国改革开放",
        "description": "中共十一届三中全会召开，决定把工作重点转移到经济建设上来，实行改革开放，中国进入社会主义现代化建设新时期。",
        "expandedDescription": "<h3>伟大的转折</h3><p>公元1978年12月18日至22日，中国共产党第十一届中央委员会第三次全体会议（简称十一届三中全会）在北京召开。</p><h3>改革开放</h3><p>全会冲破了长期以来“左”倾错误的严重束缚，否定了“以阶级斗争为纲”的指导思想，作出了把工作重点转移到社会主义现代化建设上来和实行改革开放的战略决策。全会重新确立了党的实事求是的思想路线，形成了以邓小平为核心的第二代中央领导集体。</p><h3>历史意义</h3><p>中共十一届三中全会是建国以来党的历史上具有深远意义的伟大转折，它揭开了中国改革开放的序幕，标志着中国从此进入了社会主义现代化建设的新时期。中国的经济和社会发展由此驶入了快车道。",
        "type": "china"
    },
    {
        "year": "公元1989年",
        "title": "柏林墙倒塌",
        "description": "东德政府宣布开放东西柏林边界，柏林市民拆除柏林墙，标志着东西德分裂局面结束。",
        "expandedDescription": "<h3>铁幕的裂缝</h3><p>公元1989年，东欧剧变浪潮席卷波兰、匈牙利、捷克斯洛伐克、保加利亚等东欧社会主义国家，共产党和工人党政权纷纷垮台。民主德国（东德）也面临巨大的政治压力和民众抗议。</p><h3>开放的决定</h3><p>1989年11月9日，东德政府宣布放宽公民出境限制，允许东德公民申请访问西德以及西柏林。消息传出后，聚集在柏林墙两侧的东、西柏林民众情绪高涨。</p><h3>墙的倒塌</h3><p>当晚，在民众的欢呼声中，东、西柏林的居民涌向柏林墙，一些年轻人甚至用锤子、铁锹等工具开始拆除柏林墙。这一事件象征着东西方冷战对峙格局的结束和德国统一进程的开始。1990年10月3日，民主德国正式并入联邦德国，德国重新统一。",
        "type": "world"
    },
    {
        "year": "公元1991年",
        "title": "苏联解体",
        "description": "苏联总统戈尔巴乔夫宣布辞职，苏联最高苏维埃通过决议宣布苏联停止存在，苏联解体。",
        "expandedDescription": "<h3>改革与危机</h3><p>20世纪80年代中期，苏联领导人米哈伊尔·戈尔巴乔夫推行了“改革”和“公开化”政策。然而，这些改革措施并未能挽救苏联，反而引发了社会动荡和民族分离主义情绪。</p><h3>加盟共和国独立</h3><p>1991年，苏联各加盟共和国纷纷宣布独立。8月，部分苏联高级官员发动“八一九事件”（八月政变），试图阻止苏联解体，但政变很快失败，戈尔巴乔夫的权力被进一步削弱。</p><h3>联盟的终结</h3><p>1991年12月25日，戈尔巴乔夫宣布辞去苏联总统职务。12月26日，苏联最高苏维埃通过决议，宣布苏联停止存在。世界上第一个社会主义国家苏联正式解体，分裂为15个独立国家。苏联解体标志着冷战的结束和两极格局的瓦解。",
        "type": "world"
    },
    {
        "year": "公元1997年",
        "title": "香港回归",
        "description": "中国政府对香港恢复行使主权，香港特别行政区成立，“一国两制”构想成功实践。",
        "expandedDescription": "<h3>百年耻辱的洗雪</h3><p>公元1997年7月1日零时，中国政府对香港恢复行使主权，香港特别行政区正式成立。这是中华民族百年历史上的重大事件，洗雪了香港被英国殖民统治长达156年的耻辱。</p><h3>“一国两制”的实践</h3><p>香港回归是“一国两制”伟大构想的成功实践。根据中英联合声明和香港基本法，香港在回归后保持原有的资本主义制度和生活方式，并享有高度自治权，包括行政管理、立法、独立的司法权和终审权。</p><h3>历史意义</h3><p>香港回归不仅是中国外交史上的重大胜利，也是世界历史上的重要事件。它标志着中国在实现国家统一的道路上迈出了重要步伐。",
        "type": "china"
    },
    {
        "year": "公元2001年",
        "title": "中国加入世贸组织/9·11事件",
        "description": "中国正式成为世界贸易组织成员；美国纽约和华盛顿发生恐怖袭击事件（9·11事件）。",
        "expandedDescription": "<h3>融入全球经济</h3><p>公元2001年12月11日，中国正式加入世界贸易组织，成为其第143个成员。这是中国改革开放进程中具有历史意义的一件大事，标志着中国对外开放进入了一个新的阶段。</p><h3>恐怖主义的阴影</h3><p>公元2001年9月11日，恐怖分子劫持4架民航客机，其中两架撞向纽约世界贸易中心双子塔，一架撞向五角大楼，一架在宾夕法尼亚州坠毁。事件造成近3000人死亡，是美国历史上最严重的恐怖袭击事件。</p><h3>双重影响</h3><p>这两件大事都发生在2001年，对中国和世界都产生了深远影响。中国加入世界贸易组织加速了其经济发展和全球化进程；9·11事件则改变了国际安全格局，引发了美国的反恐战争。</p>",
        "type": "world"
    },
    {
        "year": "公元2008年",
        "title": "全球金融危机",
        "description": "源自美国次贷危机的金融风暴迅速蔓延全球，导致世界经济严重衰退。",
        "expandedDescription": "<h3>风暴的起源</h3><p>公元2008年，一场源于美国次级抵押贷款市场（次贷危机）的金融风暴迅速演变为全球性的金融危机。美国的金融机构因大量发放次级贷款并将其打包成复杂的金融产品，最终导致了大规模的违约和亏损。</p><h3>危机蔓延</h3><p>随着雷曼兄弟投资银行的倒闭，危机迅速蔓延至全球各大金融机构和市场，引发了全球范围内的信贷紧缩、股市暴跌和经济衰退。许多国家的实体经济也受到严重冲击，失业率上升，国际贸易萎缩。</p><h3>国际合作与应对</h3><p>面对危机，各国政府和国际组织采取了大规模的财政刺激计划和货币政策来稳定金融市场和刺激经济复苏。二十国集团等国际协调机制在应对危机中发挥了重要作用。中国在应对金融危机中发挥了重要作用，进一步提升了其在国际事务中的影响力。</p>",
        "type": "world"
    },
    {
        "year": "公元2020年",
        "title": "新冠疫情爆发",
        "description": "新型冠状病毒肺炎疫情在中国武汉首次发现，后迅速蔓延全球，对世界政治、经济、社会造成巨大冲击。",
        "expandedDescription": "<h3>全球大流行</h3><p>公元2019年底，新型冠状病毒引发的肺炎疫情在中国武汉首次被发现。2020年初，疫情迅速扩散至中国各地，并蔓延到世界其他国家和地区，被世界卫生组织宣布为“国际关注的突发公共卫生事件”，后升级为“全球大流行”。</p><h3>深远影响</h3><p>新冠疫情是21世纪以来最严重的全球公共卫生危机。它导致数百万人感染和死亡，对全球经济、政治、社会、文化和国际关系都产生了前所未有的冲击。各国采取了封锁、隔离、旅行限制等措施，对人们的生产生活方式造成了巨大改变。</p><h3>合作与挑战</h3><p>疫情凸显了全球合作应对共同挑战的重要性，也暴露了全球公共卫生体系的脆弱性。疫苗的研发和分发成为国际社会关注的焦点。这场疫情深刻地改变了世界，其长远影响仍在持续显现。</p>",
        "type": "world"
    }
]